{"id": "665", "text": "Leaving the village road, through orchard, under arch—yet text broken and no clear arrival given", "label": 0}
{"id": "342", "text": "okay consent check done, but rain heavy, so we just cuddle on bed and type, not heading out yet", "label": 0}
{"id": "1136", "text": "sit here with me", "label": 0}
{"id": "316", "text": "left arena, crowd noisy, we squeezed through vendor stalls, crossed bridge, paused in park gazebo, and ended the chase in greenhouse", "label": 1}
{"id": "844", "text": "returned to the workshop after repairs", "label": 1}
{"id": "1129", "text": "covered by shadows", "label": 0}
{"id": "172", "text": "Bruh stop asking, we’re literally back inside the same castle again, nothing new happened really.", "label": 0}
{"id": "896", "text": "deployed to the border crossing", "label": 1}
{"id": "248", "text": "We passed by the square, didn’t bother entering, too noisy there.", "label": 0}
{"id": "782", "text": "moving around refectory hallways without entering", "label": 0}
{"id": "990", "text": "she walked out of the balcony then stepped right back in", "label": 0}
{"id": "1076", "text": "feeling lost without you", "label": 0}
{"id": "595", "text": "We left the harbor, cut through the market, circled the cathedral, and finally slipped into the guild hall.", "label": 1}
{"id": "2", "text": "I take her hand and we jump to the guild hall.", "label": 1}
{"id": "660", "text": "We climbed the ruined stairs and opened the archway leading to the royal balcony above the courtyard.", "label": 1}
{"id": "520", "text": "We started in courtyard lit by torches, wandered through the gallery where paintings hung crooked, peeked inside throne room too silent, backed away to corridor filled with whispers, and finally arrived in vault sealed with iron doors.", "label": 1}
{"id": "186", "text": "We ran out of patience and stormed into the tavren?? omg so noisy inside but at least we found seats.", "label": 1}
{"id": "609", "text": "From dawn till noon we remained in the greenhouse, pruning vines and misting orchids; no change of location took place at any point.", "label": 0}
{"id": "380", "text": "We must decide soon, but we stay here on bed talking, not moving anywhere", "label": 0}
{"id": "781", "text": "going around watch tower base outside", "label": 0}
{"id": "207", "text": "after dinner we’ll head to the shop and see if it’s still open.", "label": 0}
{"id": "812", "text": "We went around the kitchen fires and finally gathered in the dining room.", "label": 1}
{"id": "1147", "text": "rest your soul with me", "label": 0}
{"id": "384", "text": "We must plan but keep repeating tavern tavrn tavern, never actually going there", "label": 0}
{"id": "80", "text": "we go to the tavren?? haha, hurry up!", "label": 1}
{"id": "1023", "text": "Imagine us right here in the cloister garden", "label": 0}
{"id": "936", "text": "trading goods at the merchant quarter", "label": 1}
{"id": "550", "text": "After tavernn we crossed yard, passed blacksmth, and ended in librarry", "label": 1}
{"id": "410", "text": "We must hurry but keep writing market market, nothing actually chosen", "label": 0}
{"id": "688", "text": "I move past the stables, turn down a path, but nothing in my mind about where I end up.", "label": 0}
{"id": "457", "text": "We finally reached the dungeon, torches flickering as we stepped inside", "label": 1}
{"id": "291", "text": "met at fountain, detoured around bazaar, you pulled me through side street, past bakery smell mmm, then into curtained doorway of brothel", "label": 1}
{"id": "707", "text": "We moved past the tavern door, heard laughter, but line breaks and no end location is written", "label": 0}
{"id": "131", "text": "hey, I think we slide into the upper room, we'll see, tbh before it gets dark.", "label": 1}
{"id": "498", "text": "We came into the garden and stayed near the fountain", "label": 1}
{"id": "619", "text": "The choir practiced exclusively in the chapel, repeating verses until dusk; they never left the chapel, so there is no final arrival elsewhere to extract.", "label": 0}
{"id": "1120", "text": "lay with me on the bed", "label": 0}
{"id": "634", "text": "I lean on the counter while the elf archer teases me about my stamina inside the tavern. We don’t leave the tavern at all.", "label": 0}
{"id": "363", "text": "bathhouse or chapel or something, I dunno, let's just talk here in bed", "label": 0}
{"id": "546", "text": "Started at brothel, went past guildholl, and at last arrived in shrin", "label": 1}
{"id": "254", "text": "forrest was on my mind but never went, just stayed chilling", "label": 0}
{"id": "1049", "text": "just talk to me please", "label": 0}
{"id": "474", "text": "At last we end up in saloon, music and voices spilling out to street", "label": 1}
{"id": "306", "text": "left bedchamber before dawn, crossed courtyard, down spiral stair to cellar but then out again, hurried along rampart, cut through garden maze, ended up catching breath in observatory", "label": 1}
{"id": "999", "text": "he wished to enter the throne room next morning", "label": 0}
{"id": "1138", "text": "burn with desire", "label": 0}
{"id": "441", "text": "Should we climb tower stairs now and kiss at the rooftop?", "label": 1}
{"id": "106", "text": "The gates looks nice tonight but I'm not moving yet, pls.", "label": 0}
{"id": "482", "text": "I won’t follow you to castle, I’m tired already", "label": 0}
{"id": "397", "text": "I’ll lead you through corridor, down secret stairs, and straight to pantry", "label": 1}
{"id": "486", "text": "I won’t step into brothel, I don’t want to go there", "label": 0}
{"id": "731", "text": "I left the docks, climbed the stairs, and opened the bell tower where the ropes swung.", "label": 1}
{"id": "504", "text": "We ended in shrine already, incense still burning inside", "label": 1}
{"id": "1008", "text": "they were planning to walk into the garden tomorrow night", "label": 0}
{"id": "832", "text": "back at the riverside cabin finally", "label": 1}
{"id": "79", "text": "We stood still, thinking about the plan.", "label": 0}
{"id": "770", "text": "walking around the church but never going in", "label": 0}
{"id": "324", "text": "ran from courtyard to armory to smithy, sparks everywhere, we bailed, cut through archive and finished in scriptorium", "label": 1}
{"id": "195", "text": "The chapel bells rang but we never entered, just listened from outside and walked home afterwards quietly.", "label": 0}
{"id": "682", "text": "I walk away from the tower, head down some corridor, and the thought just fades with no place to arrive.", "label": 0}
{"id": "1118", "text": "burning with love", "label": 0}
{"id": "686", "text": "I cross the muddy street, dodge a cart, and then just continue forward without a clear destination.", "label": 0}
{"id": "299", "text": "we were like omg lets go somewhere fun maybe tower?? then we changed topic and stayed chatting by messages lol", "label": 0}
{"id": "694", "text": "I move away from the bonfire, step into a dark path, and just continue with no end point.", "label": 0}
{"id": "997", "text": "she was only imagining being inside the church at dawn", "label": 0}
{"id": "777", "text": "walking circles around throne hall door", "label": 0}
{"id": "639", "text": "She drops onto her knees in the throne room before me, her lips tracing my skin while the whole scene stays in that chamber.", "label": 0}
{"id": "745", "text": "staying here in forest clearing until dawn, no travel tonight", "label": 0}
{"id": "435", "text": "Can we go to the church now, just leave the tavern behind us?", "label": 1}
{"id": "135", "text": "Should we go somewhere or just stay put here, uh?", "label": 0}
{"id": "440", "text": "Can we end up in vault if we skip the courtyard and pass the chapel?", "label": 1}
{"id": "868", "text": "we're back at the well house", "label": 1}
{"id": "636", "text": "I push her against the guild hall wall, kissing her neck, not moving us anywhere else.", "label": 0}
{"id": "428", "text": "We will go to dungeon tomorrow morning if weather is fine", "label": 0}
{"id": "775", "text": "hanging around outside hidden cellar", "label": 0}
{"id": "340", "text": "bathhouse later maybe? mm i'm comfy rn, let's just keep chatting, no walking anywhere ok", "label": 0}
{"id": "365", "text": "We should leave the tavern now and head straight into the church where candles burn", "label": 1}
{"id": "735", "text": "We hurried out from the harbor, followed the lanterns, and ended at the fisher pier above the tide.", "label": 1}
{"id": "1027", "text": "Could I kiss you right here in the lantern room?", "label": 0}
{"id": "558", "text": "Our path began at castle gate, then through courtyard crowded with guards, quick step past gallery of portraits, down corridor to throne room where silence pressed, detour into archive heavy with dust, and after long searching we ended hidden in armory stacked with steel.", "label": 1}
{"id": "549", "text": "We left archivee, rushed through dorm, and stopped finally inside bathouse", "label": 1}
{"id": "34", "text": "We walk to the gates side by side.", "label": 1}
{"id": "399", "text": "We are going to leave smithy, pass forge smoke, and relax together in bathhouse", "label": 1}
{"id": "362", "text": "I wanna go to church church church repeating myself, not serious though", "label": 0}
{"id": "826", "text": "finally made it to the desert oasis", "label": 1}
{"id": "35", "text": "I guide you into the square without a word.", "label": 1}
{"id": "991", "text": "they left the inn yard briefly but returned immediately", "label": 0}
{"id": "188", "text": "We hurried through the alley and found ourselves inside the forest, branches scratching but it felt strangely safe.", "label": 1}
{"id": "17", "text": "We hurry to the gates and catch our breath.", "label": 1}
{"id": "65", "text": "People say the castle looks different at night.", "label": 0}
{"id": "1072", "text": "trapped in the storm", "label": 0}
{"id": "1017", "text": "Could we do it right here in the guild hall?", "label": 0}
{"id": "739", "text": "staying here at tavern for warm food, nobody is leaving now", "label": 0}
{"id": "753", "text": "staying here in archive room all day", "label": 0}
{"id": "704", "text": "Through the woods we marched and ended in a hunter’s cabin hidden beneath tall pines.", "label": 1}
{"id": "873", "text": "we made it back to the secret passage", "label": 1}
{"id": "116", "text": "Honestly, let's chill; walking nowhere right now, like.", "label": 0}
{"id": "408", "text": "We are going to… and then text cuts off without saying where", "label": 0}
{"id": "293", "text": "we left bedchamber before dawn, crossed courtyard with torches, down spiral steps, ignored the dungeonnn joke, and unlocked iron door to wine cellar", "label": 1}
{"id": "270", "text": "pilgrims gathered when we finally reached temple glowing with light", "label": 1}
{"id": "862", "text": "returned to the river bend", "label": 1}
{"id": "631", "text": "I kneel with the priestess by the fountain in the temple courtyard, listening to her soft prayers. We stay there the whole time.", "label": 0}
{"id": "1122", "text": "sit together on the chair", "label": 0}
{"id": "1142", "text": "close your eyes for me", "label": 0}
{"id": "773", "text": "wandering around cathedral walls but not inside", "label": 0}
{"id": "162", "text": "Man I swear we’re lost, maybe we should just stay here on the street and not move into the temple again.", "label": 0}
{"id": "356", "text": "church then dungeon then bathhouse, too many ideas, I just keep typing random", "label": 0}
{"id": "864", "text": "we're finally at the canyon rim", "label": 1}
{"id": "15", "text": "We walk to the square side by side.", "label": 1}
{"id": "800", "text": "The group argued outside the tavern hearth yet stayed put without moving further.", "label": 0}
{"id": "560", "text": "We rushed away from brothel neon lamps, passed smithy fire sparks, moved across empty courtyard, entered dorm hallway echoing with whispers, checked chapel choir then left, and finally found ourselves seated inside library under shadow of tall bookshelves.", "label": 1}
{"id": "174", "text": "Maybe later we could check the guild hall, but for now we just stayed outside laughing about old stories.", "label": 0}
{"id": "910", "text": "walked slowly to the memorial", "label": 1}
{"id": "1006", "text": "we only planned to gather in the stables tonight", "label": 0}
{"id": "863", "text": "back at the shrine finally", "label": 1}
{"id": "60", "text": "Where can we go together, anything in mind?", "label": 0}
{"id": "250", "text": "we totallly talked bout the tavren again lol, but no move at all", "label": 0}
{"id": "855", "text": "finally back at the ruins", "label": 1}
{"id": "443", "text": "Do you want us to slip into brothel after wandering the market?", "label": 1}
{"id": "1075", "text": "love burns inside me", "label": 0}
{"id": "1037", "text": "balcony", "label": 1}
{"id": "516", "text": "Starting from the guild hall we marched along the avenue, cutting across courtyard filled with guards, slipping down narrow alley near smithy, hearing the sound of hammers, moving past the dormitory door, and at last stepping inside observatory under the stars.", "label": 1}
{"id": "223", "text": "She whispered we’d head to the balcony and hide for a while.", "label": 1}
{"id": "109", "text": "Still outside, thinking; that forest might be busy anyway, well.", "label": 0}
{"id": "448", "text": "Do you wanna go… actually nevermind, forget it", "label": 0}
{"id": "126", "text": "hey, I think we slide into the square, it's fine, tbh now.", "label": 1}
{"id": "374", "text": "We must take your hand, walk past chapel, go along alley, and finally step into vault", "label": 1}
{"id": "249", "text": "Chapel doors open, but no, we walked home another way.", "label": 0}
{"id": "728", "text": "We climbed through the castle stair and ended in the watch tower overlooking the valley.", "label": 1}
{"id": "193", "text": "We stood outside, talked for an hour, didn’t step anywhere new, just wasting time under the lanterns.", "label": 0}
{"id": "233", "text": "They mentioned the market might be fun tomorrow, but tonight we stayed put.", "label": 0}
{"id": "73", "text": "If we go to the shop, will it be open?", "label": 0}
{"id": "247", "text": "Shop was mentioned, but we just scrolled on the phone instead lol.", "label": 0}
{"id": "1022", "text": "Wish to have you right here in the refectory", "label": 0}
{"id": "153", "text": "The square looked empty tonight, no point in going anywhere, we just stood around talking about nonsense.", "label": 0}
{"id": "658", "text": "We left the garden path and ended at the moon garden under silver lanterns.", "label": 1}
{"id": "1128", "text": "stand in the rain", "label": 0}
{"id": "383", "text": "We should hurry to somewhere but no clear end point, just wandering in text", "label": 0}
{"id": "940", "text": "counting coins in the treasury vault", "label": 1}
{"id": "802", "text": "Conversation circled in the library around the desk, nobody left.", "label": 0}
{"id": "795", "text": "Crossing the battlements we passed the guard posts and waited in the watch tower above the gate.", "label": 1}
{"id": "133", "text": "Honestly, let's chill; walking nowhere right now, tbh.", "label": 0}
{"id": "392", "text": "We ended up at brothel after wandering through market and along the quay", "label": 1}
{"id": "620", "text": "All filming occurred inside the old theater from rehearsal to final take; the narrative contains no movement and no terminal destination beyond the theater itself.", "label": 0}
{"id": "931", "text": "checking inventory in the storage warehouse", "label": 1}
{"id": "974", "text": "museum - ancient artifacts - egyptian mummy display hall", "label": 1}
{"id": "1104", "text": "lost in your eyes", "label": 0}
{"id": "653", "text": "After leaving the fortress gates we descended the steps into the crystal cave shining blue.", "label": 1}
{"id": "911", "text": "moved strategically to the bridge entrance", "label": 1}
{"id": "894", "text": "climbed up to the mountain viewpoint", "label": 1}
{"id": "5", "text": "We walk to the shop side by side.", "label": 1}
{"id": "102", "text": "hmm, I think we rush to the market, we'll see, lol .", "label": 1}
{"id": "455", "text": "We finally arrived at the castle gates after long wandering through the forest", "label": 1}
{"id": "221", "text": "We might head to the chapel if music starts inside, who knows.", "label": 1}
{"id": "197", "text": "Honestly bro we went back inside the same shop again, nothing new at all, just bought more snacks.", "label": 0}
{"id": "351", "text": "walking market then chapel then nah too loud, we sneak off and end inside brothel", "label": 1}
{"id": "803", "text": "We looked at the armory from the hall but never entered.", "label": 0}
{"id": "605", "text": "We stayed in the library all afternoon, comparing notes and whispering between the stacks; no relocation occurred.", "label": 0}
{"id": "787", "text": "just moving around guild hall square", "label": 0}
{"id": "251", "text": "markett looked crazy tonight haha, we didn’t step in just laughed", "label": 0}
{"id": "141", "text": "listen, I think we make our way to the castle, no drama, lol just in case.", "label": 1}
{"id": "703", "text": "We ran across the forest trail, followed broken branches, but the story just cuts off mid run", "label": 0}
{"id": "343", "text": "market, chapel, docks—i keep listing places lol, can't decide and i'm yawning, stay here", "label": 0}
{"id": "1101", "text": "covered by shadows", "label": 0}
{"id": "256", "text": "tempple stories again haha, didn’t even walk anywhere", "label": 0}
{"id": "758", "text": "we remain staying in tea room", "label": 0}
{"id": "791", "text": "Through the guild hall we skipped the hearth corner and convened in the back room behind the drapes.", "label": 1}
{"id": "310", "text": "started in plaza, detoured to shrine, tried gatehouse but guard grumpy, slipped through secret tunnel and emerged inside vault", "label": 1}
{"id": "1051", "text": "come to me quickly", "label": 0}
{"id": "740", "text": "staying here near market square benches, just waiting, no destination planned", "label": 0}
{"id": "336", "text": "left balcony, crossed gallery, tried throne room too formal lol, quick stop in scriptorium but kept moving, finally peace in archive", "label": 1}
{"id": "1021", "text": "Could we fool around right here in the war room?", "label": 0}
{"id": "833", "text": "arrived at the castle courtyard after the siege", "label": 1}
{"id": "263", "text": "after long walk we slipped into dungeon quietly with torch in hand", "label": 1}
{"id": "805", "text": "They stood by the porch steps, chatting, without going inside.", "label": 0}
{"id": "485", "text": "We are not entering chapel, the bells are too loud", "label": 0}
{"id": "70", "text": "Where can we go together, anything in mind?", "label": 0}
{"id": "961", "text": "cathedral - south transept - saint mary's chapel", "label": 1}
{"id": "751", "text": "we are staying in market square now", "label": 0}
{"id": "208", "text": "come on, let’s head to the gates, guards won’t stop us tonight.", "label": 1}
{"id": "624", "text": "We remained in the courtyard under the awning during the rainstorm, discussing plans; no movement occurred, so no final arrival location exists to answer with.", "label": 0}
{"id": "329", "text": "met at smithy, sparks flying lol, we try armory but guard grumpy, swing past archive, then secret stairs later, breathless on high ledge of rooftop", "label": 1}
{"id": "630", "text": "I lie on the futon with the catgirl inside the inn’s bedroom, feeling her tug at the blanket, and we never leave the room.", "label": 0}
{"id": "539", "text": "Started in markte, crossed churhc, and finally came into libary", "label": 1}
{"id": "50", "text": "Where can we go together, anything in mind?", "label": 0}
{"id": "650", "text": "After crossing the castle hall we descended the stairs into the throne hall below.", "label": 1}
{"id": "364", "text": "market, inn, brothel, dungeon, random list again, no final place picked", "label": 0}
{"id": "27", "text": "Both of us enter the square slowly.", "label": 1}
{"id": "831", "text": "returned to the village square at last", "label": 1}
{"id": "56", "text": "We talked about the gates but never moved.", "label": 0}
{"id": "494", "text": "I won’t step into saloon, it’s too loud and smoky inside", "label": 0}
{"id": "387", "text": "Let’s go through alley, past chapel, and finally curl up inside library", "label": 1}
{"id": "1109", "text": "sit with me forever", "label": 0}
{"id": "115", "text": "idk about the forrest, no move yet, tbh.", "label": 0}
{"id": "1092", "text": "side by side forever", "label": 0}
{"id": "101", "text": "hmm, I think we move into the shop, no drama, for real if it's open.", "label": 1}
{"id": "788", "text": "going around castle yard without entering inside", "label": 0}
{"id": "671", "text": "After leaving the palace corridor we entered the golden vault stacked with treasures.", "label": 1}
{"id": "76", "text": "We talked about the shop but never moved.", "label": 0}
{"id": "185", "text": "Castle looked amazing at night but we didn’t move in, just stood near the gates talking until midnight passed.", "label": 0}
{"id": "536", "text": "First we left tavrn, passed markte, and ended up inside bathhous", "label": 1}
{"id": "312", "text": "we flirted at bar, walked along quay, thought about lighthouse but wind strong, ducked under awning, and finally warmed up in sauna", "label": 1}
{"id": "1064", "text": "hope in my heart", "label": 0}
{"id": "638", "text": "I pull her closer into my arms in the hot bathhouse, steam rising around us as we never leave the bath.", "label": 0}
{"id": "391", "text": "We finally arrived at shrine after leaving inn yard and passing orchard", "label": 1}
{"id": "615", "text": "All experiments were conducted in the basement lab; logs show continuous presence there and no movement, hence no final arrival exists in the narrative.", "label": 0}
{"id": "1035", "text": "beer", "label": 0}
{"id": "897", "text": "stopped at the forest trail marker", "label": 1}
{"id": "590", "text": "We denied guild hall entry, refused tower stair, laughed away tavrn noise, wandered orchard path, and despite protests finished night in shrine filled with candles.", "label": 1}
{"id": "430", "text": "We are going to castle on the 5th of May during ceremony", "label": 0}
{"id": "1091", "text": "private moment together", "label": 0}
{"id": "449", "text": "Could we church church church spam lol, not serious though", "label": 0}
{"id": "783", "text": "circling stone bridge without stepping on it", "label": 0}
{"id": "22", "text": "We move into the temple quietly.", "label": 1}
{"id": "211", "text": "bro, why don’t we head to the upper room and just chill there?", "label": 1}
{"id": "705", "text": "We passed the stone circle deep in the forest clearing, moonlight shining on the mossy rocks.", "label": 1}
{"id": "230", "text": "The tavern looked so bright but we never stepped in, just kept walking past.", "label": 0}
{"id": "921", "text": "queued impatiently at the ticket booth", "label": 1}
{"id": "719", "text": "From the library corridors we turned left and ended inside the archive room full of scrolls.", "label": 1}
{"id": "1123", "text": "rest on the pillow", "label": 0}
{"id": "955", "text": "castle - main hall - throne room where the king sits", "label": 1}
{"id": "385", "text": "I will take you from the noisy tavrn into quiet garden near fountain", "label": 1}
{"id": "655", "text": "From the bustling kitchens we pushed past servants until we found the royal pantry tucked behind the racks.", "label": 1}
{"id": "171", "text": "We ended up inside the tavern after laughing too much outside, just couldn’t resist the music and drinks.", "label": 1}
{"id": "500", "text": "I went into brothel last night and found the room upstairs", "label": 1}
{"id": "667", "text": "Past the bridge we moved quickly until reaching the bell tower overlooking the square.", "label": 1}
{"id": "280", "text": "finally we reached library hidden behind square full of noise", "label": 1}
{"id": "993", "text": "we exited the cloister corridor and went back in at once", "label": 0}
{"id": "442", "text": "Could we finally rest in library after running through the plaza?", "label": 1}
{"id": "570", "text": "From castle gate to courtyard to plaza, then across guild hall, even mentioned bathhouse jokingly, but in truth I kept typing nonsense letters asdfgh until we simply never went inside anywhere.", "label": 0}
{"id": "968", "text": "manor - servant's quarters - the head butler's office", "label": 1}
{"id": "190", "text": "We dashed fast and stepped into the upper room, barely catching breath but happy to finally hide there.", "label": 1}
{"id": "496", "text": "We reached the chapel earlier and listened to the bells", "label": 1}
{"id": "643", "text": "She rides me on the velvet chair inside the brothel chamber, our cries echoing, but the narrative never leaves the room.", "label": 0}
{"id": "466", "text": "At last we ended up in greenhouse, surrounded by warmth and bright plants", "label": 1}
{"id": "683", "text": "We move across the square, weave through stalls, but then the story just keeps going without any end point.", "label": 0}
{"id": "328", "text": "we start by fountain, wander to bazaar, then to quay, you tease me toward lighthouse but wind bites, so we duck down steps and curl up inside boathouse", "label": 1}
{"id": "18", "text": "Both of us enter the shop slowly.", "label": 1}
{"id": "93", "text": "We move into the square quietly.", "label": 1}
{"id": "279", "text": "messengers waited as we entered hall of council slowly", "label": 1}
{"id": "830", "text": "we're back at the monastery gates", "label": 1}
{"id": "192", "text": "He tugged my arm and dragged me quickly into the dungeon, the smell of damp stone rushing up immediately.", "label": 1}
{"id": "815", "text": "lantern room - we climbed the lighthouse stairs and stepped inside together.", "label": 1}
{"id": "352", "text": "take ur hand, pass barracks, cross bridge, finally kiss u deep inside tower", "label": 1}
{"id": "645", "text": "I wanna fuck her in a church", "label": 0}
{"id": "538", "text": "I moved from salun to stabel yard, then went into armry at last", "label": 1}
{"id": "47", "text": "Both of us enter the guild hall slowly.", "label": 1}
{"id": "401", "text": "We must walk past barracks, avoid noise, and settle quietly in chapel", "label": 1}
{"id": "922", "text": "marched proudly to the victory monument", "label": 1}
{"id": "677", "text": "Through the shrine yard we advanced and stopped before the sacred fountain glowing with moonlight.", "label": 1}
{"id": "69", "text": "We stood still, thinking about the plan.", "label": 0}
{"id": "335", "text": "we whisper at bar, slip through kitchen, past pantry, out to garden, thunder cracks, so we retreat inside pantry", "label": 1}
{"id": "1012", "text": "they just wished to go into the kitchen at midnight", "label": 0}
{"id": "241", "text": "Upper room was mentioned once, but honestly, we didn’t move at all.", "label": 0}
{"id": "586", "text": "First I argued no, not saloon, too loud, no chapel either, no dungeon at all, but feet carried us along torchlit hall and we finally sat quietly in library corner.", "label": 1}
{"id": "523", "text": "After leaving infirmary we crossed dormitory hall, rushed along echoing corridor, descended spiral stair to cellar where barrels stood, turned aside through secret passage, and eventually arrived in bathhouse where steam curled around wooden beams.", "label": 1}
{"id": "713", "text": "We marched across the royal courtyard and finished in the guard barracks full of armor clatter.", "label": 1}
{"id": "978", "text": "factory - production line - quality control inspection booth", "label": 1}
{"id": "755", "text": "still staying inside watch tower", "label": 0}
{"id": "296", "text": "we left smithy, my hands still warm, passed barracks with soldiers shouting, down muddy road, and finally pushed open swinging doors of saloon", "label": 1}
{"id": "908", "text": "escorted outside the courtroom", "label": 1}
{"id": "852", "text": "finally reached the valley floor", "label": 1}
{"id": "557", "text": "We wandered from saloon with drunk laughter behind, passed alley lit by torches, pushed past guild hall doors where adventurers shouted, tried to enter chapel but guard stopped us, ran down cobbled street under rain, and finally reached greenhouse glowing faintly in the night.", "label": 1}
{"id": "423", "text": "Let’s move fast from dock, past warehouse, and slip inside boathouse", "label": 1}
{"id": "317", "text": "we joked about bathhause haha, stayed walking, crossed pier, around lighthouse, down ladder to boathouse", "label": 1}
{"id": "985", "text": "we stepped out of the tavern door but quickly went back inside", "label": 0}
{"id": "405", "text": "We should go to tavrn or church or castle, but I can’t pick one now", "label": 0}
{"id": "1110", "text": "sit on my lap", "label": 0}
{"id": "258", "text": "balconyy looked cool in my dream only lol, not in real life", "label": 0}
{"id": "926", "text": "reading newspapers in the hotel lobby", "label": 1}
{"id": "333", "text": "we leave campfire, take ridge path, descend to river pier, pass warehouse, then follow lamp glow down to wine cellar", "label": 1}
{"id": "325", "text": "ok, we flirt in tavern booth, then i pull you past market crowd, we peek into chapel but nope, double back through docks, hand in hand up quiet stairs, and finally slide behind steam curtains into bathhouse", "label": 1}
{"id": "1146", "text": "stay hidden in my heart", "label": 0}
{"id": "902", "text": "hurried to the bus terminal", "label": 1}
{"id": "529", "text": "Leaving archive filled with dust we moved down stairwell, stepped into courtyard alive with voices, walked corridor hung with tapestries, ducked through hidden door behind statue, and at last reached bathhouse where hot air wrapped us immediately.", "label": 1}
{"id": "756", "text": "we are staying in throne hall today", "label": 0}
{"id": "475", "text": "We’re not going anywhere tonight, just staying here", "label": 0}
{"id": "286", "text": "i dragged you from noisy inn yard, we cut across market squre lol so busy, then past chapel where choir sang, took stairssss down behind guild, and finally stepped into silent archive", "label": 1}
{"id": "1074", "text": "waiting for sunrise", "label": 0}
{"id": "632", "text": "I watch the demon queen laugh from her throne, her wings spread wide. We remain locked in the throne room scene without moving elsewhere.", "label": 0}
{"id": "527", "text": "Our path began in castle courtyard, then curved toward orchard, followed trail lined with stones into forest, passed the ruined barn, moved under archway of crumbling tower, and finally came to chapel bright with stained glass.", "label": 1}
{"id": "348", "text": "I go tavrn first lol, then grab ur hand, run alley, finally crash inside library", "label": 1}
{"id": "1096", "text": "standing under rainbow", "label": 0}
{"id": "289", "text": "started in plaza, ran through gardens, hand in hand through shadowed gallery, we sneaked past guards and hid together inside observatory", "label": 1}
{"id": "548", "text": "From churh square we hurried across plaza and slipped into greenhouze", "label": 1}
{"id": "154", "text": "She laughed and pulled me along, so we ended up inside the guild hall even though I wanted to go home earlier.", "label": 1}
{"id": "612", "text": "The guards kept their post in the tower through the storm, never leaving the platform; no arrival anywhere else is present in this account.", "label": 0}
{"id": "215", "text": "Should we head to the forest tomorrow or just stay in town?", "label": 0}
{"id": "778", "text": "staying outside and going around granary loft", "label": 0}
{"id": "1113", "text": "hold my hand tightly", "label": 0}
{"id": "209", "text": "Thinking we might head to the chapel before everyone gathers there.", "label": 1}
{"id": "689", "text": "Crossing the market road, weaving through people, I just keep going without a real place to stop.", "label": 0}
{"id": "1066", "text": "waiting under the rain", "label": 0}
{"id": "86", "text": "idk, the forrest maybe someday", "label": 0}
{"id": "699", "text": "From the lighthouse stairs we kept climbing, the sea roaring outside, and opened the lantern room at the top.", "label": 1}
{"id": "490", "text": "I won’t follow to tower, I’m afraid of heights", "label": 0}
{"id": "272", "text": "after shopping we sat near shop at corner street", "label": 1}
{"id": "204", "text": "ok ok let’s head to the temple, maybe it’s quiet inside now.", "label": 1}
{"id": "1054", "text": "stand by me forever", "label": 0}
{"id": "307", "text": "argued in alley, ran toward inn, you said 'dungeonnn??' lol no, we jogged by barracks, paused at bakery, and at last unlocked side door of armory", "label": 1}
{"id": "528", "text": "We left the noisy brothel and stumbled into alley, circled around marketplace crowded with sellers, ran past bakery full of smoke, brushed against church walls echoing with hymns, and finally ended in cellar beneath stone steps.", "label": 1}
{"id": "1126", "text": "warm me by the fire", "label": 0}
{"id": "1090", "text": "let’s fly into adventure", "label": 0}
{"id": "915", "text": "ascended to the tower balcony", "label": 1}
{"id": "746", "text": "staying here near temple courtyard, plans postponed, we remain in place", "label": 0}
{"id": "9", "text": "We make our way to the square tonight.", "label": 1}
{"id": "478", "text": "I refuse to enter tavrn, it’s too crowded inside", "label": 0}
{"id": "883", "text": "we've been here since morning", "label": 0}
{"id": "373", "text": "We should leave fountain, pass the gardens, and enter the greenhouse together", "label": 1}
{"id": "1087", "text": "rest on my chest", "label": 0}
{"id": "842", "text": "arrived back at the pier after the voyage", "label": 1}
{"id": "264", "text": "she pulled me ahead and we rushed toward forest clearing full of mist", "label": 1}
{"id": "14", "text": "Shall we step onto the gates right away?", "label": 1}
{"id": "1029", "text": "I crave you right here in the castle yard", "label": 0}
{"id": "563", "text": "From orchard hedge we slipped into courtyard, heard guards shouting from watchtower, ran across training yard, peeked through armory door but closed it, hurried down torchlit passage, and finally emerged inside shrine glowing with incense and candlelight.", "label": 1}
{"id": "480", "text": "I’m not going to library, I don’t feel like reading", "label": 0}
{"id": "839", "text": "finally reached the tower's base", "label": 1}
{"id": "938", "text": "praying quietly in the temple sanctuary", "label": 1}
{"id": "1127", "text": "lost under the stars", "label": 0}
{"id": "792", "text": "We passed the choir stalls, walked beyond the altar, and assembled in the prayer hall under the lanterns.", "label": 1}
{"id": "453", "text": "Do you think we should just stay here instead of moving anywhere?", "label": 0}
{"id": "760", "text": "we're staying here in the chapel", "label": 0}
{"id": "377", "text": "We have to leave soon, not sure where though, maybe chapel maybe garden, undecided", "label": 0}
{"id": "509", "text": "I did not enter chapel, I refused to cross the door", "label": 0}
{"id": "785", "text": "loitering around tea room doors", "label": 0}
{"id": "786", "text": "we kept going around chapel outside walls", "label": 0}
{"id": "600", "text": "All negotiations took place in the council chamber from start to finish; we never left the room.", "label": 0}
{"id": "68", "text": "No need to move; the weather looks bad.", "label": 0}
{"id": "1003", "text": "the plan was to reach the balcony at night", "label": 0}
{"id": "234", "text": "We thought about entering the guild hall, instead we laughed outside and left.", "label": 0}
{"id": "295", "text": "started in noisy market, i pressed close in crowd, we cut into quiet lane, over tiny canal, and ended up together beneath paper lanterns in teahouse", "label": 1}
{"id": "867", "text": "back at the trading post", "label": 1}
{"id": "42", "text": "We move into the square quietly.", "label": 1}
{"id": "130", "text": "okay, I think we make our way to the forest, it's fine, lol together.", "label": 1}
{"id": "444", "text": "Can we go hide inside cellar instead of staying in courtyard?", "label": 1}
{"id": "200", "text": "We should head to the forest before it gets dark, don’t you think?", "label": 1}
{"id": "848", "text": "arrived at the fortress walls at dawn", "label": 1}
{"id": "407", "text": "We have to move fast, market? docks? chapel? no decision made", "label": 0}
{"id": "268", "text": "we leaned on balcony overlooking city roofs shining with lanterns", "label": 1}
{"id": "257", "text": "we joked about the dungeonnn omg, but stayed in bed", "label": 0}
{"id": "314", "text": "started in workshop, checked armory then forge smoke ugh, tried chapel no, circled barracks and finally rested in barrack courtyard", "label": 1}
{"id": "823", "text": "back at the harbor finally after the long journey", "label": 1}
{"id": "872", "text": "finally at the observatory dome", "label": 1}
{"id": "1025", "text": "Shall we do it right here on the dome deck?", "label": 0}
{"id": "78", "text": "No need to move; the weather looks bad.", "label": 0}
{"id": "572", "text": "Started in tavrn, drifted toward shrine, slipped into plaza crowd, ended up saying tomorrow we will go to observatory, not today, so in the end there was no actual arrival now.", "label": 0}
{"id": "508", "text": "We never reached the tower, the storm stopped us", "label": 0}
{"id": "353", "text": "I go inn yard then kitchen but too crowded, so we sneak off into pantry", "label": 1}
{"id": "97", "text": "Let's head into the square before it gets dark.", "label": 1}
{"id": "464", "text": "At last we arrived at the bathhouse, steam rising warmly from inside", "label": 1}
{"id": "52", "text": "We left the shop and went back inside.", "label": 0}
{"id": "969", "text": "warehouse - storage floor - the valuable goods section", "label": 1}
{"id": "4", "text": "Shall we step onto the tavern right away?", "label": 1}
{"id": "571", "text": "We moved past armory, ran into orchard, crossed saloon threshold, peeked into greenhouse, but then my message cut off, no clear arrival, just noise and broken sentence left hanging", "label": 0}
{"id": "555", "text": "We left tavrn at dawn, stumbled into crowded market where vendors shouted and smoke from grills filled the air, crossed plaza buzzing with jugglers, paused near chapel doors but didn’t enter, circled the old well, and finally descended spiral steps into dungeon dark and cold.", "label": 1}
{"id": "799", "text": "We talked near the hearth but never left the common room.", "label": 0}
{"id": "835", "text": "we made it back to the forest clearing", "label": 1}
{"id": "946", "text": "organizing books at the library archive", "label": 1}
{"id": "531", "text": "Our steps carried us away from rooftop balcony, through gallery decorated with portraits, down stairwell into throne room echoing with silence, across chamber full of guards, and at last into vault with its locked iron chest.", "label": 1}
{"id": "117", "text": "hey, I think we walk to the tavern, it's fine, right? before it gets dark.", "label": 1}
{"id": "433", "text": "I’m gonna drag you to shrine on Saturday night after game", "label": 0}
{"id": "331", "text": "from garden we go balcony then bedroom—nah too public, i tug you along hallway, through hidden panel, and we end in small stone vault", "label": 1}
{"id": "912", "text": "traveled wearily to the roadside inn", "label": 1}
{"id": "670", "text": "We ran through the smithy floor, passed noisy anvils, but then text glitch no fin", "label": 0}
{"id": "1069", "text": "under the bright stars", "label": 0}
{"id": "160", "text": "Bro we just talked about the shop, didn’t even go, just talking and wasting time lol.", "label": 0}
{"id": "10", "text": "We go to the forest together now.", "label": 1}
{"id": "98", "text": "market?? or what lol, we didn't move anyway", "label": 0}
{"id": "66", "text": "We talked about the forest but never moved.", "label": 0}
{"id": "841", "text": "we're finally at the cave entrance", "label": 1}
{"id": "219", "text": "guess we’ll head to the square after meeting the others here.", "label": 0}
{"id": "675", "text": "After sneaking from the dungeon stair we entered the iron chamber locked behind bars.", "label": 1}
{"id": "1050", "text": "don’t run from me", "label": 0}
{"id": "471", "text": "We finally ended in garden pavilion, night air calm and soft", "label": 1}
{"id": "261", "text": "we ran into tavern before rain started pouring hard", "label": 1}
{"id": "445", "text": "Should we go somewhere tonight, maybe church or tavrn, I can’t decide?", "label": 0}
{"id": "518", "text": "At first we lingered in garden, then followed stream into forest clearing, stumbled across old bridge above rushing water, paused at ruined tower watching lightning in distance, hurried through muddy road near tavrn, and ended the journey inside dungeon carved in stone.", "label": 1}
{"id": "492", "text": "I’m not going into armory, the guards will see us", "label": 0}
{"id": "321", "text": "we started in infirmary, went to chapel for candle, back to infirmary, then mess hall for tea, and finally dozed together in dormitory", "label": 1}
{"id": "158", "text": "We left the tavern already and went back inside right after, so technically we didn’t change places at all.", "label": 0}
{"id": "871", "text": "back at the forge after midnight", "label": 1}
{"id": "72", "text": "We left the square and went back inside.", "label": 0}
{"id": "712", "text": "Through the cathedral’s arch we walked, crossed aisles, but the line just ends abruptly", "label": 0}
{"id": "414", "text": "Can we go to church or bathhouse or garden? I don’t know, just listing", "label": 0}
{"id": "468", "text": "At last we reached the inn yard, tired from travel and laughter fading", "label": 1}
{"id": "821", "text": "watch tower - we ascended the spiral stair and posted at the top above the gate.", "label": 1}
{"id": "83", "text": "fine, let's just head to the castel ...", "label": 1}
{"id": "394", "text": "Let’s sneak from fountain, cut across gardens, and stop inside vault", "label": 1}
{"id": "82", "text": "ok ok, we move into the markett!!!", "label": 1}
{"id": "273", "text": "soldiers hid under bridge while rain poured heavily", "label": 1}
{"id": "16", "text": "I guide you into the castle without a word.", "label": 1}
{"id": "979", "text": "bank - security vault - the precious metals storage chamber", "label": 1}
{"id": "714", "text": "Past the garden hedge we stopped near a gazebo painted white, vines curling around its pillars.", "label": 1}
{"id": "28", "text": "We make our way to the market tonight.", "label": 1}
{"id": "458", "text": "At last we came to the chapel, bells ringing loudly above our heads", "label": 1}
{"id": "1039", "text": "lol", "label": 0}
{"id": "1097", "text": "lost in the fog", "label": 0}
{"id": "708", "text": "We pushed through the castle corridors and gathered finally in the crypt beneath the chapel.", "label": 1}
{"id": "276", "text": "exhausted we collapsed on bench outside arena gates late at night", "label": 1}
{"id": "594", "text": "We avoided dungeon, I said impossible, not tonight, turned away from shrine, from orchard too, but after circling aimlessly we finally entered library dimly lit inside.", "label": 1}
{"id": "865", "text": "arrived back at the town square", "label": 1}
{"id": "304", "text": "*blushes* lolol ok brb, not moving, rain outside wowww", "label": 0}
{"id": "1068", "text": "warming up by the fire", "label": 0}
{"id": "1036", "text": "wine", "label": 0}
{"id": "626", "text": "I lean closer to the dark elf inside the inn, listening to her whisper in my ear. We remain against the same wooden pillar all along.", "label": 0}
{"id": "419", "text": "I’ll take you through orchard, down hidden path, and end up at shrine", "label": 1}
{"id": "1052", "text": "I wait for you here", "label": 0}
{"id": "856", "text": "returned to the chapel yard", "label": 1}
{"id": "1082", "text": "close your eyes for me", "label": 0}
{"id": "898", "text": "set up camp at the theater box office", "label": 1}
{"id": "322", "text": "left tavern, alley rain, tried loft but dusty, crossed square, bell rang at church, we said later, and finally curled up in library", "label": 1}
{"id": "103", "text": "okay, I think we step into the temple, it's fine, lol now.", "label": 1}
{"id": "30", "text": "Let's head into the castle before it gets dark.", "label": 1}
{"id": "641", "text": "She presses me against the bookshelf in the library, whispering filthy words, but the entire act happens only in the library.", "label": 0}
{"id": "1081", "text": "you are all I need", "label": 0}
{"id": "371", "text": "We are going to leave market stalls, sneak down hidden lane, and reach brothel", "label": 1}
{"id": "881", "text": "we stayed here all day without moving", "label": 0}
{"id": "409", "text": "Let’s go go go repeat, I type church church church but no final action", "label": 0}
{"id": "432", "text": "We will head to observatory next month when skies are clear", "label": 0}
{"id": "846", "text": "finally at the summit after the climb", "label": 1}
{"id": "427", "text": "I’m gonna lead you to library at midnight after guards change", "label": 0}
{"id": "1014", "text": "I was only hoping to end up in the cloister at dawn", "label": 0}
{"id": "1010", "text": "she imagined us climbing into the dome deck at sunrise", "label": 0}
{"id": "780", "text": "walking around porch again and again", "label": 0}
{"id": "606", "text": "The briefing unfolded entirely inside the war room from the first slide to the last question; there was no arrival elsewhere.", "label": 0}
{"id": "556", "text": "Starting from orchard path we walked across wet fields, climbed wooden bridge where rain hammered planks, ducked into stable yard full of restless horses, ignored smithy smoke, passed through dormitory hall, and at last arrived inside bathhouse heavy with steam and warmth.", "label": 1}
{"id": "49", "text": "We go to the castle together now.", "label": 1}
{"id": "462", "text": "At last we end up in cellar, cold stone walls around us as door shut behind", "label": 1}
{"id": "417", "text": "We are going to slip out of dormitory and meet together in library", "label": 1}
{"id": "1089", "text": "hold my arm tightly", "label": 0}
{"id": "669", "text": "From the academy library we entered a hidden stair, ending in the arcane chamber full of glyphs.", "label": 1}
{"id": "889", "text": "standing guard at the castle gates", "label": 0}
{"id": "32", "text": "We move into the guild hall quietly.", "label": 1}
{"id": "429", "text": "Let’s meet in tower on Friday evening after training ends", "label": 0}
{"id": "806", "text": "We mentioned the back room but remained in the guild hall all night.", "label": 0}
{"id": "819", "text": "prayer hall - we crossed the cloister and prayed together in silence.", "label": 1}
{"id": "845", "text": "back at the crossroads where we split up", "label": 1}
{"id": "790", "text": "We crossed the courtyard, ignored the smithy, and gathered in the armory beside the weapons.", "label": 1}
{"id": "300", "text": "met in tavren, talked about chapel and markte, maybe later go bridge idk, anyway we just kept talking", "label": 0}
{"id": "88", "text": "shoop shoop, no movement today", "label": 0}
{"id": "750", "text": "still staying in guild hall tonight", "label": 0}
{"id": "517", "text": "We walked away from campfire smoke into orchard path, turned toward fields where windmills creaked, descended steps by river pier, passed an abandoned warehouse with broken windows, followed lantern light through corridor, and finally arrived in chapel lit by candles.", "label": 1}
{"id": "210", "text": "She smiled and said we’d head to the balcony for some fresh air.", "label": 1}
{"id": "761", "text": "still staying in the dungeon", "label": 0}
{"id": "587", "text": "We rejected tower climb, refused smithy, said no to tavrn noise, wandered orchard path aimlessly, until surrendering to quiet we ended in greenhouse glowing softly.", "label": 1}
{"id": "765", "text": "we keep staying in castle yard", "label": 0}
{"id": "914", "text": "standing motionless at the crossroads", "label": 0}
{"id": "1009", "text": "we hoped to sit in the observatory yard next day", "label": 0}
{"id": "53", "text": "If we go to the castle, will it be open?", "label": 0}
{"id": "506", "text": "We didn’t go to dungeon, we turned back before the gate", "label": 0}
{"id": "533", "text": "Leaving stable yard we crossed small bridge, paused in plaza alive with jugglers, went into alley dripping with rain, entered bakery full of warm smell, and finally rested inside tavrn noisy with songs.", "label": 1}
{"id": "672", "text": "Through the ruined stairwell, after torchlit halls, we reached the crystal cavern shining deep.", "label": 1}
{"id": "741", "text": "staying here by river bridge, rain keeps us under shelter, no moving anywhere", "label": 0}
{"id": "1134", "text": "kiss my hand softly", "label": 0}
{"id": "40", "text": "Let's head into the shop before it gets dark.", "label": 1}
{"id": "424", "text": "I will guide you out of courtyard, up spiral stair, and into observatory", "label": 1}
{"id": "145", "text": "Is the market open, do you know? Just asking, actually.", "label": 0}
{"id": "389", "text": "Can we go from smithy across bridge, sneak down steps, and end in cellar", "label": 1}
{"id": "137", "text": "Honestly, let's chill; walking nowhere right now, you know.", "label": 0}
{"id": "886", "text": "standing by the old fountain in the square", "label": 0}
{"id": "690", "text": "I rush down the alley, cut between fences, and keep running without reaching any final point.", "label": 0}
{"id": "99", "text": "gats are loud ugh, let's stay", "label": 0}
{"id": "937", "text": "writing letters at the scribal office", "label": 1}
{"id": "971", "text": "tower - spiral staircase - the astronomer's observatory", "label": 1}
{"id": "136", "text": "alright, we move into the shoop!!! pls, let's just do it now.", "label": 1}
{"id": "301", "text": "i said park? you said bathhouse?? then both of us laughed and said tomorrow, so where did we end up going?", "label": 0}
{"id": "547", "text": "We skipped towerr steps, avoided bathhos, and finally sat in obsrvatory", "label": 1}
{"id": "1132", "text": "resting on my mind", "label": 0}
{"id": "552", "text": "Leaving armry behind, we walked lane, and came at last into chapel", "label": 1}
{"id": "884", "text": "still waiting in the same spot", "label": 0}
{"id": "678", "text": "I move past the market stalls, push through the crowd, but then just keep wandering without stopping anywhere.", "label": 0}
{"id": "38", "text": "We make our way to the gates tonight.", "label": 1}
{"id": "954", "text": "performing surgery in the medical theater", "label": 1}
{"id": "1019", "text": "I want you right here in the hidden cellar", "label": 0}
{"id": "85", "text": "market?? or what lol, we didn't move anyway", "label": 0}
{"id": "793", "text": "From the tower stairs we skipped the scribe desk and debated in the map chamber filled with scrolls.", "label": 1}
{"id": "62", "text": "We left the gates and went back inside.", "label": 0}
{"id": "684", "text": "I wander past the orchard, follow the fence line, and keep rambling without settling anywhere specific.", "label": 0}
{"id": "1046", "text": "look at you now", "label": 0}
{"id": "341", "text": "tower? lighthouse?? idk, i'm blushing and staying put, brb water 😅", "label": 0}
{"id": "217", "text": "Maybe later we can head to the castle, but not right now.", "label": 1}
{"id": "822", "text": "chapter house - we left the choir behind and assembled for reading minutes there.", "label": 1}
{"id": "962", "text": "library - basement level - the restricted archive", "label": 1}
{"id": "635", "text": "She straddles my lap right here in the tavern booth, moaning softly while we keep drinking.", "label": 0}
{"id": "1073", "text": "hidden in the darkness", "label": 0}
{"id": "489", "text": "We must not enter archive, it’s locked and restricted", "label": 0}
{"id": "789", "text": "From the dining hall we moved past the kitchens and ended in the wine cellar near the racks.", "label": 1}
{"id": "1133", "text": "stand by my side", "label": 0}
{"id": "747", "text": "staying here in library corner reading quietly, not heading to any location", "label": 0}
{"id": "930", "text": "sharpening weapons at the armory bench", "label": 1}
{"id": "332", "text": "started in courtyard, rain drives us under arcade, we test door of brothel but i say not today, we circle around and choose soft light of bathhouse", "label": 1}
{"id": "119", "text": "so, I think we sneak into the forest, no drama, for real .", "label": 1}
{"id": "575", "text": "At first I swore I wouldn’t step into dungeon, too dark and damp, we wandered plaza complaining, tried chapel but laughed it off, circled tavrn doorway, and finally I gave in as we entered bathhouse filled with steam.", "label": 1}
{"id": "77", "text": "Maybe later we will pick a place, not now.", "label": 0}
{"id": "972", "text": "hospital - surgical ward - operating theater number three", "label": 1}
{"id": "376", "text": "We must run somewhere fast, maybe market, maybe docks, but we never decided", "label": 0}
{"id": "998", "text": "we dreamt of walking into the market square tomorrow evening", "label": 0}
{"id": "1", "text": "Let's head into the gates before it gets dark.", "label": 1}
{"id": "717", "text": "We left the temple yard, passed incense smoke, and finally prayed inside the inner sanctum.", "label": 1}
{"id": "771", "text": "circling around market square without entering", "label": 0}
{"id": "90", "text": "We move into the shop quietly.", "label": 1}
{"id": "584", "text": "We denied tavrn, market, dungeon all in turn, argued loudly, then walked out anyway, followed lanterns into alley, and at last we reached archive full of parchment smell.", "label": 1}
{"id": "206", "text": "lol too noisy here, let’s head to the square instead maybe.", "label": 1}
{"id": "603", "text": "From the opening bell to the last toast, everything happened in the great hall; there was no movement to another place.", "label": 0}
{"id": "431", "text": "I’ll take you into vault tomorrow night after feast is over", "label": 0}
{"id": "287", "text": "after flirting at bar, we took carriage past river pier, you joked about going to dungeonn, but we kept walking and slipped behind stalls until we reached lighthouse", "label": 1}
{"id": "36", "text": "We hurry to the castle and catch our breath.", "label": 1}
{"id": "94", "text": "I guide you into the temple without a word.", "label": 1}
{"id": "1002", "text": "we talked about being in the dining hall tomorrow", "label": 0}
{"id": "633", "text": "I play with Aqua in the bathhouse as she splashes water and teases me, but the entire moment stays in that same bathhouse.", "label": 0}
{"id": "24", "text": "We walk to the castle side by side.", "label": 1}
{"id": "744", "text": "staying here beside castle gate, patrols outside make us wait", "label": 0}
{"id": "393", "text": "I’m going to pull you from courtyard, past hall, and into armory", "label": 1}
{"id": "360", "text": "I wanna go to market, oh wait no, just teasing you, staying in room", "label": 0}
{"id": "512", "text": "We haven’t gone into cellar, the door was locked tight", "label": 0}
{"id": "808", "text": "From the fortress yard we skipped the gatehouse and mustered in the soldiers' barracks.", "label": 1}
{"id": "8", "text": "Both of us enter the market slowly.", "label": 1}
{"id": "214", "text": "He asked me to head to the guild hall together, sounded serious.", "label": 1}
{"id": "582", "text": "We hesitated at castle wall saying no way inside, wandered orchard edge, ran down alley avoiding guards, and in spite of refusal we ended quietly in chapel under bells.", "label": 1}
{"id": "138", "text": "Honestly, let's chill; walking nowhere right now, in a sec.", "label": 0}
{"id": "31", "text": "I take her hand and we jump to the square.", "label": 1}
{"id": "642", "text": "I take her onto the guild hall table, pushing aside empty mugs, and we keep going there without any relocation.", "label": 0}
{"id": "890", "text": "walked through the park and arrived at the rose garden after sunset", "label": 1}
{"id": "695", "text": "We cross the gate, wander into streets, and keep walking without any final location mentioned.", "label": 0}
{"id": "67", "text": "Maybe later we will pick a place, not now.", "label": 0}
{"id": "794", "text": "We ignored the innkeeper at the counter and sat together in the tavern booth beneath the lamp.", "label": 1}
{"id": "224", "text": "Let’s head to the shop before it closes, we need supplies.", "label": 1}
{"id": "220", "text": "Shall we head to the gates now, or wait till it’s darker?", "label": 1}
{"id": "537", "text": "We walked churh yard, slipped past guilld hall, and finally entered dungeonn", "label": 1}
{"id": "168", "text": "Nah don’t wanna move, staying outside near the gates but not going in this time, too crowded.", "label": 0}
{"id": "920", "text": "lingering sadly at the departure lounge", "label": 0}
{"id": "398", "text": "I’m gonna rush through market stalls, dodge the guard, and meet you in tower", "label": 1}
{"id": "447", "text": "Can we maybe go later, I don’t know where, just asking randomly", "label": 0}
{"id": "438", "text": "Could we sneak past guards and hide inside armory for a while?", "label": 1}
{"id": "481", "text": "We must not go to shrine, it’s forbidden for us", "label": 0}
{"id": "521", "text": "Leaving docks behind we moved across slippery quay, ducked inside warehouse to avoid rain, slipped through back door toward stable yard, climbed narrow stairs attached to tower, and finally entered rooftop garden where flowers bloomed despite the night.", "label": 1}
{"id": "1063", "text": "lost in a dream", "label": 0}
{"id": "542", "text": "We moved through marcket stalls, skipped chaple, and finally sat in bathhous", "label": 1}
{"id": "935", "text": "forging swords in the blacksmith workshop", "label": 1}
{"id": "309", "text": "after training yard, we checked watchtower, then stable, almost chose boathouse, but rain pushed us through narrow lane to teahouse", "label": 1}
{"id": "1125", "text": "walk together in the moonlight", "label": 0}
{"id": "451", "text": "Do you wanna go somewhere but I never name the place", "label": 0}
{"id": "553", "text": "We passed churhc, tavrn, and guildholl, then finished finally in dungeonn", "label": 1}
{"id": "13", "text": "We move into the castle quietly.", "label": 1}
{"id": "125", "text": "Where should we even go, any ideas at all, lol?", "label": 0}
{"id": "905", "text": "ducked behind the market stalls", "label": 1}
{"id": "110", "text": "Is the market open, do you know? Just asking, tbh.", "label": 0}
{"id": "893", "text": "standing idle by the harbor pier", "label": 0}
{"id": "824", "text": "finally reached the mountain peak at sunset", "label": 1}
{"id": "818", "text": "throne hall - we moved beyond the corridor and convened beneath the banners.", "label": 1}
{"id": "282", "text": "first we walked through garden with roses, then crossed bridge covered in moss, after that wandered near castle yard where guards shouted, and at last we reached guild hall filled with music and firelight", "label": 1}
{"id": "569", "text": "We walked orchard, saw tower, skipped chapel, stopped to argue about garden, typed gibberish ggggg tavrn churh, and finally the night ended with no location chosen at all.", "label": 0}
{"id": "463", "text": "We finally came to the observatory, stars shining bright above", "label": 1}
{"id": "202", "text": "They told us to head to the guild hall, meeting starts soon lol.", "label": 1}
{"id": "875", "text": "arrived back somewhere in the mountains", "label": 1}
{"id": "33", "text": "Shall we step onto the dungeon right away?", "label": 1}
{"id": "843", "text": "finally back at the garden gate", "label": 1}
{"id": "565", "text": "We left tavrn, wandered across plaza, joked about chapel then market, kept naming places but never settled, talked until tired, and in the end nowhere, just stayed outside under rain without going in.", "label": 0}
{"id": "851", "text": "back at the old oak tree", "label": 1}
{"id": "1148", "text": "sing for me softly", "label": 0}
{"id": "663", "text": "After crossing the market stalls we entered the secret passage behind the tapestry.", "label": 1}
{"id": "987", "text": "they exited the marketplace square only to come back right away", "label": 0}
{"id": "743", "text": "staying here on balcony watching city lights, not stepping to another place", "label": 0}
{"id": "878", "text": "finally arrived at what's-its-name", "label": 1}
{"id": "243", "text": "Forest stories were fun, but we never even left the square bench.", "label": 0}
{"id": "515", "text": "We left tavrn just before dawn, wandered through the busy market where merchants shouted and music played, paused at chapel when bells began to ring, crossed the cobblestone bridge, and finally entered library with its tall shelves of dusty tomes.", "label": 1}
{"id": "357", "text": "wanna go castle, or market, or maybe garden, but in the end I change my mind", "label": 0}
{"id": "738", "text": "staying here in church, doors shut, not heading out tonight", "label": 0}
{"id": "1144", "text": "walk with me forever", "label": 0}
{"id": "191", "text": "The guild hall looked packed but we didn’t even enter this time, just walked past and laughed.", "label": 0}
{"id": "104", "text": "listen, I think we move into the shop, please hurry, for real before it gets dark.", "label": 1}
{"id": "989", "text": "we left the castle yard for a moment and came back instantly", "label": 0}
{"id": "618", "text": "We waited on the riverside pier for hours, counting barges and reading letters; the account shows no departure and thus no destination reached at the end.", "label": 0}
{"id": "274", "text": "we sneaked inside barn to hide from guards chasing us", "label": 1}
{"id": "589", "text": "At first no inn yard, I said, no chapel either, turned from market stalls, but lanterns guided us onward and in the end we slipped into bathhouse heavy with mist.", "label": 1}
{"id": "721", "text": "Through the ruined fortress we marched and reached the war room where maps were spread.", "label": 1}
{"id": "967", "text": "temple - inner sanctum - the high priest's chamber", "label": 1}
{"id": "827", "text": "back at camp after three days of hiking", "label": 1}
{"id": "284", "text": "we started morning in forest clearing where fog still hung between trees, then crossed old bridge above rushing river, after that wandered through market square filled with shouting merchants and smell of bread, moved past chapel where bells rang loudly, hurried along road toward castle walls guarded by soldiers, slipped into guild hall where adventurers laughed, and at last descended stone stairs into dungeon lit only by torches", "label": 1}
{"id": "346", "text": "I wanna go church with you rn, hear the bells together", "label": 0}
{"id": "499", "text": "We ended up in library after wandering the whole plaza", "label": 1}
{"id": "1103", "text": "heart on fire for you", "label": 0}
{"id": "726", "text": "Past the market road and over the bridge we gathered finally in the merchant hall filled with stalls.", "label": 1}
{"id": "1067", "text": "standing in the snow", "label": 0}
{"id": "850", "text": "returned to the library steps", "label": 1}
{"id": "155", "text": "Honestly idk maybe tomorrow we could check the castle but right now I’m too tired to move anywhere.", "label": 0}
{"id": "354", "text": "I wanna climb to observatory, stare at stars with you pressed against me", "label": 0}
{"id": "734", "text": "After the temple courtyard we advanced forward and stopped in the meditation hall filled with incense.", "label": 1}
{"id": "87", "text": "gats are loud ugh, let's stay", "label": 0}
{"id": "664", "text": "We ran through the fortress gates, past the courtyard, but then the sentence just cut", "label": 0}
{"id": "1135", "text": "lost in my thoughts", "label": 0}
{"id": "105", "text": "okay, I think we head to the castle, then rest, right? if it's open.", "label": 1}
{"id": "226", "text": "Honestly, I’d rather head to the guild hall than stay outside.", "label": 1}
{"id": "199", "text": "Didn’t feel like moving anywhere tonight, castle looked nice but we only admired it from outside, nothing more.", "label": 0}
{"id": "701", "text": "We passed through the palace gates, crossed the banquet hall, and ended in the throne hall filled with banners.", "label": 1}
{"id": "7", "text": "We hurry to the forest and catch our breath.", "label": 1}
{"id": "1030", "text": "Can we be together right here in the observatory tower?", "label": 0}
{"id": "338", "text": "holding hands, we leave guild hall, down alley, up tower stairs then nope, across bridge, and finally under stars on rooftop", "label": 1}
{"id": "698", "text": "We entered the cathedral and walked past the altar until we finally stood inside the nave beneath the arches.", "label": 1}
{"id": "1000", "text": "they were planning to go to the cloister tonight", "label": 0}
{"id": "574", "text": "We set off from guild hall, talked about chapel, then saloon, but in truth it was only imagination, we just kept writing locations in chat and never arrived anywhere real.", "label": 0}
{"id": "1018", "text": "What if I take you right here on the balcony?", "label": 0}
{"id": "1124", "text": "dive into blankets", "label": 0}
{"id": "857", "text": "back at the meadow's edge", "label": 1}
{"id": "659", "text": "Through the broken chapel gates we descended into the lower crypt where candles burned faintly.", "label": 1}
{"id": "182", "text": "Rushing fast through the crowded path, we slipped into the guild hall, the noise of laughter echoing loudly.", "label": 1}
{"id": "685", "text": "We run across the field, through a hedge, and just keep moving without ever reaching a spot.", "label": 0}
{"id": "801", "text": "They admired the shrine doors but remained in the courtyard the whole time.", "label": 0}
{"id": "1038", "text": "cloister", "label": 1}
{"id": "0", "text": "We go to the dungeon together now.", "label": 1}
{"id": "118", "text": "Should we go somewhere or just stay put here, idk?", "label": 0}
{"id": "616", "text": "We remained in the monastery refectory through the afternoon lectures; nothing indicates departure or arrival elsewhere within the text provided.", "label": 0}
{"id": "891", "text": "moved to the checkpoint for night duty", "label": 1}
{"id": "163", "text": "He dragged me quickly through the alley and into the dungeon, the air was damp and smelled awful instantly.", "label": 1}
{"id": "469", "text": "We finally arrived in archive, dust of ancient books filling the air", "label": 1}
{"id": "759", "text": "staying in players tunnel all match", "label": 0}
{"id": "484", "text": "I refuse to go to market, it’s too noisy and crowded", "label": 0}
{"id": "711", "text": "From the tavern hall we slipped into the back room, whispers and dice games all around.", "label": 1}
{"id": "816", "text": "wine cellar - we descended past the press room and arrived in the cool chamber below.", "label": 1}
{"id": "437", "text": "Do you wanna go to garden, sit with me by the fountain?", "label": 0}
{"id": "269", "text": "merchants shouted while we crossed market square crowded with people", "label": 1}
{"id": "349", "text": "dragging you from noisy square, down hidden steps, I end up in dungeon with you", "label": 1}
{"id": "19", "text": "We make our way to the forest tonight.", "label": 1}
{"id": "240", "text": "Dungeon sounded scary, we joked about it but never went near, lol.", "label": 0}
{"id": "37", "text": "Both of us enter the forest slowly.", "label": 1}
{"id": "909", "text": "marched to the fortress wall", "label": 1}
{"id": "1004", "text": "he said we would go into the cellar tomorrow morning", "label": 0}
{"id": "944", "text": "repairing nets at the fishing dock", "label": 1}
{"id": "727", "text": "From the manor kitchen we slipped into the servant quarters tucked behind narrow doors.", "label": 1}
{"id": "591", "text": "I shouted no dungeon tonight, ran across courtyard angry, avoided chapel line, turned back from saloon, but somehow we still ended seated in archive silent and dusty.", "label": 1}
{"id": "706", "text": "From the tavern’s noise we slipped into the cellar below, the air heavy with old barrels.", "label": 1}
{"id": "510", "text": "We didn’t come into bathhouse, we walked away instead", "label": 0}
{"id": "43", "text": "Shall we step onto the forest right away?", "label": 1}
{"id": "91", "text": "We go to the gates together now.", "label": 1}
{"id": "1026", "text": "I need you right here in the throne hall", "label": 0}
{"id": "75", "text": "People say the guild hall looks different at night.", "label": 0}
{"id": "236", "text": "We stood near the gates but didn’t head inside, just chatted for a while.", "label": 0}
{"id": "45", "text": "I guide you into the gates without a word.", "label": 1}
{"id": "48", "text": "We make our way to the shop tonight.", "label": 1}
{"id": "874", "text": "back at the tavern hearth", "label": 1}
{"id": "212", "text": "I guess we better head to the dungeon, feels like an adventure.", "label": 1}
{"id": "860", "text": "arrived at the city gates before sunset", "label": 1}
{"id": "460", "text": "At last we reached the brothel, candlelight glowing through the curtains", "label": 1}
{"id": "917", "text": "stationed permanently at the guard post", "label": 0}
{"id": "89", "text": "we talk about the castel again, no going", "label": 0}
{"id": "134", "text": "markett?? or what, just asking, ngl. right now idk", "label": 0}
{"id": "467", "text": "We finally came into the tower, the view wide and silent around us", "label": 1}
{"id": "21", "text": "I take her hand and we jump to the gates.", "label": 1}
{"id": "378", "text": "We are going to go to dungeon no wait inn no wait market, I keep changing mind", "label": 0}
{"id": "252", "text": "the castel glowed, but nah we only watched from far away", "label": 0}
{"id": "583", "text": "I said not going anywhere, sat by well, yet we rose, moved across plaza, skipped saloon despite laughter, climbed narrow stair, and finally stood together on rooftop under stars.", "label": 1}
{"id": "413", "text": "We have to hurry, but I stop typing mid sentence and never finish", "label": 0}
{"id": "92", "text": "We go to the dungeon together now.", "label": 1}
{"id": "973", "text": "prison - maximum security - the warden's interrogation room", "label": 1}
{"id": "715", "text": "We crossed the park, turned left, but then words scatter with no final point given", "label": 0}
{"id": "170", "text": "No idea bro, the forest is spooky at night but we didn’t actually move there, just talking about it.", "label": 0}
{"id": "654", "text": "We exited the rain-slick streets, entered the cathedral and paused at the cathedral porch to catch our breath.", "label": 1}
{"id": "514", "text": "We never entered tavrn, we stayed outside on the street", "label": 0}
{"id": "1034", "text": "How about right here at the stone bridge?", "label": 0}
{"id": "564", "text": "We wandered away from smithy sparks, ducked under arch into alley, crossed saloon where music spilled out, climbed tower stair halfway but turned back, slipped through archive hall dusty with scrolls, and finally rested together in bathhouse thick with steam.", "label": 1}
{"id": "976", "text": "courthouse - third floor - judge's private chambers", "label": 1}
{"id": "693", "text": "We slip through the crowd, dodge some voices, but then the moment just drifts on endlessly.", "label": 0}
{"id": "1020", "text": "Need you right here in the choir hall tonight", "label": 0}
{"id": "754", "text": "we keep staying in wine cellar", "label": 0}
{"id": "899", "text": "took position at the watchtower", "label": 1}
{"id": "11", "text": "Let's head into the market before it gets dark.", "label": 1}
{"id": "1083", "text": "lean on me always", "label": 0}
{"id": "1048", "text": "I’m falling for you", "label": 0}
{"id": "149", "text": "Where should we even go, any ideas at all, you know?", "label": 0}
{"id": "305", "text": "we started at tavern, then you dragged me past market, we peeked into chapel, circled back to docks, changed mind near tower, and finally slipped behind curtains into bathhouse", "label": 1}
{"id": "238", "text": "Balcony view was tempting, but nope, we just stayed downstairs instead.", "label": 0}
{"id": "479", "text": "We’re not stepping into bathhouse, not tonight", "label": 0}
{"id": "697", "text": "We moved beyond the tavern, slipped along the riverbank, and then nothing else is said about where we end up.", "label": 0}
{"id": "716", "text": "From the manor we slipped down the stair and gathered in the wine cellar beneath the hall.", "label": 1}
{"id": "1044", "text": "idk", "label": 0}
{"id": "956", "text": "university - north wing - professor's private office", "label": 1}
{"id": "879", "text": "we're back at that building near the river", "label": 1}
{"id": "227", "text": "Don’t forget, we must head to the forest to gather herbs.", "label": 1}
{"id": "1084", "text": "look only at me", "label": 0}
{"id": "255", "text": "guild hall? nah bro, just memes no moving lol", "label": 0}
{"id": "477", "text": "We will not head to church, I’m not in the mood", "label": 0}
{"id": "796", "text": "We went through the vineyard gate, ignored the fountain, and settled in the wine cellar under the manor.", "label": 1}
{"id": "122", "text": "The tavern looks nice tonight but I'm not moving yet, ngl.", "label": 0}
{"id": "275", "text": "after long journey we ended sitting near fountain in square", "label": 1}
{"id": "330", "text": "we talk hard boundaries first, then leave dorm, pass infirmary, peek at chapel choir, change course through corridor, and end tucked together in library", "label": 1}
{"id": "127", "text": "alright, I think we slide into the market, it's fine, tbh now.", "label": 1}
{"id": "766", "text": "still staying inside nave with group", "label": 0}
{"id": "283", "text": "our path began in forest clearing, continued across ruined tower, then we rested shortly beside fountain in square, later hurried toward temple surrounded by pilgrims, and finally stopped inside library near square", "label": 1}
{"id": "769", "text": "going around tavern all evening", "label": 0}
{"id": "947", "text": "brewing ale in the monastery cellar", "label": 1}
{"id": "849", "text": "finally back at the sacred grove", "label": 1}
{"id": "918", "text": "went up to the museum balcony", "label": 1}
{"id": "1078", "text": "fear inside my chest", "label": 0}
{"id": "1105", "text": "stay close to me", "label": 0}
{"id": "454", "text": "Should we go to tavrn or garden or bathhouse, I keep changing my mind", "label": 0}
{"id": "513", "text": "I didn’t step into archive, I turned back at the stairs", "label": 0}
{"id": "228", "text": "Fine, fine, let’s head to the castle since you insist so much.", "label": 1}
{"id": "1117", "text": "full of hope tonight", "label": 0}
{"id": "598", "text": "From the courtyard we slipped through the servants’ corridor, crossed the kitchen, and finally reached the pantry.", "label": 1}
{"id": "203", "text": "hurry up, we gotta head to the market before stalls close down!", "label": 1}
{"id": "768", "text": "we are staying in guard barracks overnight", "label": 0}
{"id": "1085", "text": "touch my lips softly", "label": 0}
{"id": "532", "text": "We left orchard path, crossed muddy fields, stumbled into barn full of hay, crept into courtyard near blacksmith forge, and finally arrived in observatory gazing at stars overhead.", "label": 1}
{"id": "1059", "text": "rest your head on my shoulder", "label": 0}
{"id": "403", "text": "I will lead you away from campfire smoke, over ridge, and hide in cave", "label": 1}
{"id": "179", "text": "Fine fine, running together into the dungeon before sunrise felt thrilling though a bit too dangerous lol.", "label": 1}
{"id": "288", "text": "we argued in alley, kissed under balcony, hurried by watchtower, crossed old brige, and after a long laugh collapsed on cushions in harem", "label": 1}
{"id": "400", "text": "Let’s go fast from docks, turn by warehouse, and slip inside boathouse", "label": 1}
{"id": "382", "text": "We are going to maybe market maybe bathhouse maybe shrine, nothing chosen at all", "label": 0}
{"id": "1056", "text": "touch my chest softly", "label": 0}
{"id": "44", "text": "We walk to the forest side by side.", "label": 1}
{"id": "882", "text": "just sitting around talking for hours", "label": 0}
{"id": "58", "text": "No need to move; the weather looks bad.", "label": 0}
{"id": "156", "text": "We rushed past the fountain and stepped quickly into the temple before the guards noticed us sneaking in.", "label": 1}
{"id": "302", "text": "still here, nowhere yet", "label": 0}
{"id": "12", "text": "I take her hand and we jump to the forest.", "label": 1}
{"id": "369", "text": "We have to run from smithy, cut through the barracks, and finally rest in armory", "label": 1}
{"id": "412", "text": "We are going to maybe dungeon maybe castle, I keep changing words", "label": 0}
{"id": "811", "text": "Through the library corridor we skipped the study desk and ended in the archive room filled with charts.", "label": 1}
{"id": "836", "text": "finally arrived at the ancient temple", "label": 1}
{"id": "416", "text": "I’m gonna lead you past the market and into bathhouse this evening", "label": 0}
{"id": "465", "text": "We finally reached the armory, rows of weapons gleaming under torchlight", "label": 1}
{"id": "1065", "text": "dancing in the moonlight", "label": 0}
{"id": "959", "text": "mansion - east wing - the lord's private study", "label": 1}
{"id": "951", "text": "carving statues at the sculptor's studio", "label": 1}
{"id": "173", "text": "We ran fast through the dark streets and into the forest, branches scratching as we moved deeper inside.", "label": 1}
{"id": "804", "text": "Talking about the archive annex took all evening; no one went there.", "label": 0}
{"id": "525", "text": "Starting from inn we walked into kitchen filled with smoke, bypassed pantry stacked with bread, followed passage out to rear courtyard, passed empty guard post, and ended our steps inside armory where weapons gleamed under torchlight.", "label": 1}
{"id": "184", "text": "Let’s sneak quietly onto the balcony before anyone notices, it’s high but the view might be worth the climb.", "label": 1}
{"id": "1106", "text": "look only at you", "label": 0}
{"id": "426", "text": "We are going to bathhouse next week when we finish quest", "label": 0}
{"id": "729", "text": "After leaving the swamp we crossed some stones, but then the narrative cut without end.", "label": 0}
{"id": "132", "text": "Not leaving, weather turned gross; maybe later the market, hmm.", "label": 0}
{"id": "29", "text": "We go to the market together now.", "label": 1}
{"id": "345", "text": "I wanna go to a church, take your hand and lead you inside softly lit by candles", "label": 0}
{"id": "165", "text": "Come on, hurry let’s move into the chapel before the bells start ringing, I think mass is about to start.", "label": 1}
{"id": "425", "text": "I will take you to the church tomorrow after the banquet", "label": 0}
{"id": "51", "text": "The market is huge and crowded today.", "label": 0}
{"id": "181", "text": "Honestly we just stayed outside, never entered the shop this time, just argued about what snacks to buy later.", "label": 0}
{"id": "375", "text": "We should go to tavern or church or castle, not sure yet, maybe later, no final choice", "label": 0}
{"id": "347", "text": "taking u from market stalls straight into bathhouse steamy room", "label": 1}
{"id": "1011", "text": "we were only thinking about being in the war room tomorrow", "label": 0}
{"id": "925", "text": "drinking coffee at the corner cafe", "label": 1}
{"id": "854", "text": "arrived at the manor house grounds", "label": 1}
{"id": "733", "text": "We crossed the hills, shouted in the wind, but then the line dissolves and no place is reached.", "label": 0}
{"id": "491", "text": "We’re not heading to guild hall, not in the mood for company", "label": 0}
{"id": "1042", "text": "food", "label": 0}
{"id": "176", "text": "Lmao no new place, we just walked back into the tavern again cause it was raining outside badly.", "label": 0}
{"id": "81", "text": "somehow we end up inside the forrest, lol", "label": 1}
{"id": "253", "text": "shooop shoop vibe outside, no entering anywhere today", "label": 0}
{"id": "718", "text": "We pushed through the monastery gate and gathered at the prayer hall where monks whispered chants.", "label": 1}
{"id": "266", "text": "friends decided to climb tower near river even as storm gathered", "label": 1}
{"id": "601", "text": "The rehearsal ran entirely inside the theater; no relocation, no final arrival elsewhere was made.", "label": 0}
{"id": "772", "text": "going around guild hall just outside", "label": 0}
{"id": "166", "text": "We literally circled back into the tavern again, no new place at all, just same loud crowd waiting.", "label": 0}
{"id": "502", "text": "I reached the cellar yesterday before everyone else", "label": 1}
{"id": "646", "text": "We climbed the old lighthouse until we reached the lantern room glowing above the sea.", "label": 1}
{"id": "913", "text": "ran quickly to the school gates", "label": 1}
{"id": "144", "text": "hey, I think we head to the tavern, please hurry, right? because it's warm.", "label": 1}
{"id": "623", "text": "The class was held entirely in the chemistry lab; students did not leave the room, and the narrative lists no destination achieved afterwards.", "label": 0}
{"id": "543", "text": "Passing orchrd and towre, we stopped only inside libray at the end", "label": 1}
{"id": "25", "text": "I guide you into the market without a word.", "label": 1}
{"id": "906", "text": "climbed up to the lighthouse beacon", "label": 1}
{"id": "829", "text": "finally at the lighthouse after the storm", "label": 1}
{"id": "323", "text": "market noise pushed us to side street, then arcade, we tested door to guild hall but locked, circled and ended at counting house", "label": 1}
{"id": "602", "text": "We remained in the library throughout the day, consulting maps and making notes, without stepping outside.", "label": 0}
{"id": "239", "text": "The shop looked closed anyway, so we passed by and kept talking.", "label": 0}
{"id": "668", "text": "We slipped through the garden hedge and paused by the rose fountain spraying gently.", "label": 1}
{"id": "928", "text": "playing cards at the tavern table", "label": 1}
{"id": "627", "text": "I watch Megumin sulk in the guild hall, waving her staff and shouting about Explosion magic, but we never go anywhere else.", "label": 0}
{"id": "1093", "text": "dreaming with closed eyes", "label": 0}
{"id": "1007", "text": "I was dreaming about being at the rose fountain at noon", "label": 0}
{"id": "984", "text": "continuing our conversation from where we started", "label": 0}
{"id": "1086", "text": "kiss my hand gently", "label": 0}
{"id": "1016", "text": "Do you want me right here in the chapel?", "label": 0}
{"id": "503", "text": "We came into observatory and looked at the stars above", "label": 1}
{"id": "696", "text": "I run past the blacksmith, turn into another lane, but then it all fades with no arrival written.", "label": 0}
{"id": "610", "text": "The arbitration session took place entirely inside the council chamber; participants stayed seated and never departed the room, leaving no arrival to report.", "label": 0}
{"id": "1077", "text": "desire takes me over", "label": 0}
{"id": "121", "text": "Should we go somewhere or just stay put here, hmm?", "label": 0}
{"id": "164", "text": "Square looked lively but we didn’t step in, just watched the musicians for a while and left home.", "label": 0}
{"id": "1043", "text": "hidden cellar rn", "label": 1}
{"id": "143", "text": "okay, I think we rush to the guild hall, it's fine, right? quietly.", "label": 1}
{"id": "530", "text": "We started by the well in garden, then followed hedge-lined path, entered orchard where fruit weighed branches, left through small gate, and finally came into saloon bright with noise and laughter.", "label": 1}
{"id": "895", "text": "went to the shopping mall entrance and waited there", "label": 1}
{"id": "608", "text": "All rehearsals were held on the main stage; the cast never left the stage area during the entire session, so no final arrival elsewhere exists.", "label": 0}
{"id": "1107", "text": "just talk to me tonight", "label": 0}
{"id": "26", "text": "We hurry to the market and catch our breath.", "label": 1}
{"id": "450", "text": "Should we? maybe? I can’t choose any place at all", "label": 0}
{"id": "580", "text": "We said no chapel, no saloon, not tonight, skipped guild hall too, circled plaza stalls, and eventually stopped together in greenhouse warm with glass fogging.", "label": 1}
{"id": "986", "text": "after leaving the garden gate we immediately entered it again", "label": 0}
{"id": "885", "text": "waiting at the train platform for the next departure", "label": 0}
{"id": "151", "text": "Not sure dude, should we even go anywhere now or just chill here by the fire, tavern sounded noisy earlier anyway.", "label": 0}
{"id": "1080", "text": "just beside me forever", "label": 0}
{"id": "344", "text": "dungeon?? haha nooo, i'm teasing and spamming letters duuuungeooon, anyway not moving tonight", "label": 0}
{"id": "656", "text": "We crossed the nave quietly, opened the iron grate, and went down to the lower crypt under the altar.", "label": 1}
{"id": "774", "text": "just going around wine cellar entrance", "label": 0}
{"id": "1058", "text": "lay down on the couch", "label": 0}
{"id": "834", "text": "finally back at the old windmill", "label": 1}
{"id": "982", "text": "haven't moved from this spot all day", "label": 0}
{"id": "647", "text": "From the ruined cathedral aisles we advanced forward and finally prayed in the golden shrine.", "label": 1}
{"id": "814", "text": "archive annex - we reached it after passing through the map vault.", "label": 1}
{"id": "903", "text": "lurking near the old cemetery gate", "label": 0}
{"id": "901", "text": "assigned to the embassy building", "label": 1}
{"id": "934", "text": "mixing potions at the alchemist laboratory", "label": 1}
{"id": "339", "text": "we grab cloaks at keep gate, loop around courtyard, try chapel then choir too loud, I point to side door and we end up in observatory", "label": 1}
{"id": "124", "text": "hmm, I think we step into the dungeon, it's fine, tbh just in case.", "label": 1}
{"id": "147", "text": "okay, I think we make our way to the castle, it's fine, for real if it's open.", "label": 1}
{"id": "456", "text": "At last we end up in shrine, leaving behind the crowded market and noisy street", "label": 1}
{"id": "522", "text": "We left noisy saloon full of laughter, moved down lantern-lit street, turned into alley lined with shuttered shops, paused near blacksmith hammering late, slipped into courtyard shadowed by ivy, and finally rested inside shrine glowing with incense smoke.", "label": 1}
{"id": "404", "text": "We finally arrived in saloon after skipping tavern and crossing the dusty road", "label": 1}
{"id": "507", "text": "I haven’t been to castle, I avoided it completely", "label": 0}
{"id": "198", "text": "We sneaked fast up the stairs into the upper room, heart pounding but finally some privacy lol.", "label": 1}
{"id": "927", "text": "cooking dinner in the mountain cabin", "label": 1}
{"id": "840", "text": "back at the inn's stable yard", "label": 1}
{"id": "64", "text": "Should we go somewhere or just stay here?", "label": 0}
{"id": "519", "text": "From marketplace we slipped between stalls heavy with fruit, pushed toward city gate crowded with soldiers, climbed stairwell that circled outer wall, explored archive where dust covered scrolls, but closed doors forced us onward, until we found ourselves in armory lined with steel.", "label": 1}
{"id": "213", "text": "After talking a while, we decided to head to the tavern anyway.", "label": 1}
{"id": "61", "text": "The guild hall is huge and crowded today.", "label": 0}
{"id": "644", "text": "I hold her against the temple altar, kissing her hard, but all of it remains inside the temple without moving anywhere else.", "label": 0}
{"id": "461", "text": "We finally arrived in library after running down the long corridor", "label": 1}
{"id": "100", "text": "hey, I think we sneak into the dungeon, then rest, lol before it gets dark.", "label": 1}
{"id": "724", "text": "I left the mountain trail, followed torchlight, and reached the hidden cave glowing faintly.", "label": 1}
{"id": "810", "text": "We ignored the bar counter and entered the inn chamber upstairs.", "label": 1}
{"id": "888", "text": "waiting outside the doctor's office", "label": 0}
{"id": "545", "text": "I ran from innn yard, skipped chapell, and ended finally in cellarr", "label": 1}
{"id": "559", "text": "We left docks at sunset, crossed narrow quay slippery with rain, stopped briefly near lighthouse but storm winds forced us back, moved across market stalls still lit with oil lamps, climbed hidden stair behind warehouse, and finally entered observatory under star-filled sky.", "label": 1}
{"id": "1028", "text": "Maybe right here in the market square under stars", "label": 0}
{"id": "315", "text": "campfire goodbye, over ridge, by waterfall spray, into cave then out, through gate and finally inside castle keep", "label": 1}
{"id": "996", "text": "they hope to gather in the arcade tonight", "label": 0}
{"id": "183", "text": "nah bruh we’re literally back inside the same square again lol nothing even changed except the music stopped.", "label": 0}
{"id": "933", "text": "feeding horses in the royal stables", "label": 1}
{"id": "180", "text": "We wandered too long and finally stepped inside the chapel, candles still burning faintly, it felt calm for once.", "label": 1}
{"id": "196", "text": "We rushed through the crowd and into the square where musicians played, energy buzzing all around us.", "label": 1}
{"id": "977", "text": "school - administration - principal's disciplinary office", "label": 1}
{"id": "1094", "text": "fantasy in my mind", "label": 0}
{"id": "112", "text": "alright, I think we make our way to the square, it's fine, tbh for a minute.", "label": 1}
{"id": "732", "text": "From the guild entrance we passed a hallway and ended in the council chamber buzzing with debate.", "label": 1}
{"id": "541", "text": "Left the churhc quickly, crossed plazza, and hid together in dungeonn", "label": 1}
{"id": "980", "text": "we've been talking here for hours without going anywhere", "label": 0}
{"id": "235", "text": "She said the square was too crowded, so we just walked the other way.", "label": 0}
{"id": "1060", "text": "looking for adventure again", "label": 0}
{"id": "386", "text": "I’m gonna drag you across market and end up together in bathhouse", "label": 1}
{"id": "483", "text": "We’re not leaving the room, better stay here warm", "label": 0}
{"id": "244", "text": "The tavern music was loud but we didn’t go in, just danced outside.", "label": 0}
{"id": "662", "text": "We walked across the temple courtyard and prayed finally inside the inner sanctum heavy with incense.", "label": 1}
{"id": "1140", "text": "sleep side by side", "label": 0}
{"id": "1114", "text": "lean against my shoulder", "label": 0}
{"id": "1045", "text": "stay close to me", "label": 0}
{"id": "887", "text": "sitting on the park bench watching pigeons", "label": 0}
{"id": "1115", "text": "let’s go on an adventure", "label": 0}
{"id": "950", "text": "tending flowers in the greenhouse garden", "label": 1}
{"id": "1032", "text": "I picture us right here in the skylight court", "label": 0}
{"id": "596", "text": "Starting at the village square, we followed the riverbank, crossed the wooden bridge, and ended up in the watchtower.", "label": 1}
{"id": "358", "text": "I go to the church, wait no, I mean tavrn, nevermind we never left bed", "label": 0}
{"id": "495", "text": "We went into dungeon already and sat by the torchlight", "label": 1}
{"id": "825", "text": "we're back at the old church where we started", "label": 1}
{"id": "604", "text": "We kept our post in the guard tower all night, watching the road; no departure, no arrival, no change of location.", "label": 0}
{"id": "175", "text": "I dragged her hand and together we moved into the market, smells of bread and spices hitting instantly.", "label": 1}
{"id": "622", "text": "The planning session remained in the strategy room from start to finish; notes confirm no relocation, so there is no final arrival to identify in the text.", "label": 0}
{"id": "218", "text": "they said we should head to the temple before it rains again.", "label": 1}
{"id": "319", "text": "began at harbor, past customs shed, through warehouse row, guards shouted, we sprinted across yard and hid in office", "label": 1}
{"id": "55", "text": "People say the square looks different at night.", "label": 0}
{"id": "709", "text": "After crossing the cloister we entered the choir inside the cathedral where voices echoed.", "label": 1}
{"id": "434", "text": "We should go to brothel later this week but not right now", "label": 0}
{"id": "205", "text": "If you want, we can head to the castle, the view is awesome.", "label": 1}
{"id": "577", "text": "I said no way to castle, refused tower climb, rejected guild hall noise, we kept debating under rain, and yet we slipped through courtyard until reaching shrine glowing warmly.", "label": 1}
{"id": "904", "text": "relocated to the police station", "label": 1}
{"id": "813", "text": "back room - we ended there after slipping out from the guild hall corridor.", "label": 1}
{"id": "303", "text": "we ran for castle gate then turned back to the inn and then again changed mind and paused to think without moving", "label": 0}
{"id": "1099", "text": "burning with fire inside", "label": 0}
{"id": "807", "text": "I stared at the choir stalls yet stayed in the nave.", "label": 0}
{"id": "111", "text": "Where should we even go, any ideas at all, you know?", "label": 0}
{"id": "1112", "text": "rest your head on my chest", "label": 0}
{"id": "439", "text": "May we leave market stalls and slip down steps into bathhouse?", "label": 1}
{"id": "194", "text": "okay okay we ended up inside the markeet?? haha spelling aside, grabbed fruit and laughed too loud.", "label": 1}
{"id": "148", "text": "okay, I think we slide into the tavern, then rest, lol quietly.", "label": 1}
{"id": "723", "text": "From the academy gates we hurried across the yard and ended inside the lecture hall buzzing with voices.", "label": 1}
{"id": "1071", "text": "shine in the sunlight", "label": 0}
{"id": "680", "text": "I rush out of the tavern door, run down the street, and keep going without any idea where to stop.", "label": 0}
{"id": "919", "text": "hiked overnight to the summit cairn", "label": 1}
{"id": "372", "text": "We are going to slip out of courtyard, climb secret stairs, and arrive at observatory", "label": 1}
{"id": "320", "text": "from garden to balcony to bedroom then no, you grabbed cloak, we tiptoed via secret stairs and arrived at rooftop", "label": 1}
{"id": "381", "text": "We have to head out eventually but right now just listing places church, inn, docks", "label": 0}
{"id": "784", "text": "going around dome deck but never climbed", "label": 0}
{"id": "271", "text": "we waited inside chapel until storm outside stopped completely", "label": 1}
{"id": "388", "text": "I’ll take you by hand, run through square, and hide with you in dungeon", "label": 1}
{"id": "1095", "text": "singing in the rain", "label": 0}
{"id": "128", "text": "alright, I think we sneak into the square, then rest, lol just in case.", "label": 1}
{"id": "691", "text": "We move over the bridge, splash through puddles, but then there’s just nothing at the end.", "label": 0}
{"id": "585", "text": "I refused shrine, avoided orchard, we left dorm angry, circled courtyard twice, and even though I said not tonight, we ended side by side inside armory full of steel.", "label": 1}
{"id": "861", "text": "finally back at the farm house", "label": 1}
{"id": "932", "text": "practicing spells at the magic circle", "label": 1}
{"id": "1070", "text": "lost under the clouds", "label": 0}
{"id": "798", "text": "We skipped the porch, went past the well, and met in the chapel nave beside the candles.", "label": 1}
{"id": "965", "text": "academy - west tower - the alchemical laboratory", "label": 1}
{"id": "859", "text": "we made it back to the camp fire", "label": 1}
{"id": "298", "text": "after the banquet in hall, we slipped behind tapestries, crept along secret tunnel, and tumbled into a tiny hidden chamber called vault", "label": 1}
{"id": "566", "text": "I dragged you past orchard, toward stable, across courtyard, we shouted about dungeon maybe later, then argued about bathhouse, but in truth we never entered anything, just kept walking circles until stopping in street.", "label": 0}
{"id": "277", "text": "we drifted toward harbor listening to waves crash quietly", "label": 1}
{"id": "487", "text": "We’re not going to observatory, the climb is too long", "label": 0}
{"id": "452", "text": "Can we… I stop typing before saying where to go", "label": 0}
{"id": "140", "text": "alright, I think we sneak into the market, we'll see, tbh quietly.", "label": 1}
{"id": "178", "text": "We debated for an hour and ended up nowhere, just standing around near the gates chatting endlessly.", "label": 0}
{"id": "1130", "text": "dreaming by your side", "label": 0}
{"id": "943", "text": "grinding herbs at the medicine shop", "label": 1}
{"id": "679", "text": "We cross the bridge quickly, turn left into some narrow lane, and then just drift off with no place in mind.", "label": 0}
{"id": "661", "text": "From the smithy we rushed through corridors and entered the guard barracks full of clattering armor.", "label": 1}
{"id": "177", "text": "Hey let’s sneak quietly into the uppper room?? kinda risky but nobody will notice us up there.", "label": 1}
{"id": "963", "text": "palace - royal gardens - the secret meditation grove", "label": 1}
{"id": "3", "text": "We move into the gates quietly.", "label": 1}
{"id": "505", "text": "I never went to shrine, I stayed away the whole time", "label": 0}
{"id": "1061", "text": "we stayed private together", "label": 0}
{"id": "1141", "text": "private time together", "label": 0}
{"id": "20", "text": "Shall we step onto the shop right away?", "label": 1}
{"id": "1145", "text": "candle light on us", "label": 0}
{"id": "916", "text": "ran desperately to the airport gate", "label": 1}
{"id": "960", "text": "ship - lower deck - captain's quarters at the stern", "label": 1}
{"id": "779", "text": "went around players tunnel without going in", "label": 0}
{"id": "994", "text": "after stepping out of the kitchen we turned and entered again immediately", "label": 0}
{"id": "361", "text": "castle then tower then something else, I just wanna kiss here not walk", "label": 0}
{"id": "395", "text": "We should escape the square, hurry across road, and hide inside greenhouse", "label": 1}
{"id": "350", "text": "I wanna take u to garden, hold u close near fountain", "label": 0}
{"id": "847", "text": "we're back at the old mill pond", "label": 1}
{"id": "722", "text": "We crossed the garden, passed broken statues, but the story line breaks and no arrival is clear.", "label": 0}
{"id": "318", "text": "from stables to orchard to granary (smell lol), checked hayloft, then slipped into wine cellar", "label": 1}
{"id": "1053", "text": "you belong to me", "label": 0}
{"id": "459", "text": "We finally ended in garden, where fountain sparkled and flowers surrounded us", "label": 1}
{"id": "648", "text": "Across the misty park we wandered and finally stood beside the marble fountain.", "label": 1}
{"id": "23", "text": "Shall we step onto the guild hall right away?", "label": 1}
{"id": "74", "text": "Should we go somewhere or just stay here?", "label": 0}
{"id": "267", "text": "bells rang when we stepped inside church at midnight", "label": 1}
{"id": "710", "text": "We drifted across the meadow, followed a stream, then words fall apart with no destination", "label": 0}
{"id": "939", "text": "healing wounded at the field hospital", "label": 1}
{"id": "1108", "text": "I’m falling for you", "label": 0}
{"id": "748", "text": "staying here in library", "label": 0}
{"id": "488", "text": "I’m not walking to courtyard, my legs hurt too much", "label": 0}
{"id": "246", "text": "Temple bells rang, but nah, we didn’t enter, too cold already.", "label": 0}
{"id": "231", "text": "The forest was quiet tonight, we talked about it but stayed near the road.", "label": 0}
{"id": "497", "text": "I arrived at the tavrn and waited for you inside", "label": 1}
{"id": "366", "text": "We should cross the plaza, skip the market noise, and end up together inside bathhouse", "label": 1}
{"id": "290", "text": "left tavarn giggling, skirted the docks, climbed windy path to ruined fort, rain started, so we ducked into the closest doorway which was library", "label": 1}
{"id": "1088", "text": "sit on my knees", "label": 0}
{"id": "614", "text": "The debate began and ended in the university auditorium without intermission or exit; there was no arrival at a different place to report.", "label": 0}
{"id": "1119", "text": "fear inside me", "label": 0}
{"id": "95", "text": "We make our way to the castle tonight.", "label": 1}
{"id": "988", "text": "I went out of the library hall but returned before closing the door", "label": 0}
{"id": "1062", "text": "always by your side", "label": 0}
{"id": "57", "text": "Maybe later we will pick a place, not now.", "label": 0}
{"id": "41", "text": "I take her hand and we jump to the shop.", "label": 1}
{"id": "370", "text": "We have to cross the bridge, avoid the guards at gate, and end inside dungeon", "label": 1}
{"id": "1143", "text": "lost in your smile", "label": 0}
{"id": "924", "text": "strolled comfortably to the riverside pavilion", "label": 1}
{"id": "573", "text": "I typed dungeon dungeon again and again, then castle maybe, bathhouse maybe, but we never actually entered any of them, it was just spamming places without choosing.", "label": 0}
{"id": "1005", "text": "they hoped to meet in the chapel next week", "label": 0}
{"id": "652", "text": "We bypassed the old monastery and finally knelt within the sacred chamber lit by candles.", "label": 1}
{"id": "702", "text": "From the palace kitchens we slipped behind the curtains and discovered the royal pantry stacked with jars.", "label": 1}
{"id": "285", "text": "we slipped out of tavern after teasing each other, wandered along rainy street, ducked through side gate by castle, you tugged my hand toward quieter place and we ended up whispering in warm glow of bathhouse", "label": 1}
{"id": "554", "text": "At first in orchrd, then smithhy, then innn yard, and finally inside bathhous", "label": 1}
{"id": "524", "text": "We left the barracks at midday, stepped over muddy training yard, paused at gate where guards questioned us, hurried through square filled with jugglers, slipped into arcade, and finally came to greenhouse filled with the scent of wet leaves.", "label": 1}
{"id": "945", "text": "polishing armor in the guard barracks", "label": 1}
{"id": "966", "text": "inn - second floor - room overlooking the market", "label": 1}
{"id": "964", "text": "fortress - inner keep - commander's war council chamber", "label": 1}
{"id": "446", "text": "Do you think we should go? where? castle? dungeon? garden? too many options", "label": 0}
{"id": "390", "text": "Should we skip tavern, avoid the guards, and end up in observatory", "label": 1}
{"id": "150", "text": "After wandering for half an hour we finally sneaked into the castle, it looked spooky but also kind of exciting at night lol.", "label": 1}
{"id": "71", "text": "The gates is huge and crowded today.", "label": 0}
{"id": "762", "text": "staying put in choir today", "label": 0}
{"id": "281", "text": "we left street full of shops and noise, hurried across market square, passed by old church with broken windows, climbed narrow stairs near river and finally entered tavern glowing with lanterns", "label": 1}
{"id": "54", "text": "Should we go somewhere or just stay here?", "label": 0}
{"id": "828", "text": "arrived back at the train station just in time", "label": 1}
{"id": "551", "text": "We moved from marcket, skipped orchard, and finally found ourselves in castlee", "label": 1}
{"id": "396", "text": "We have to cross the bridge, slip behind guild, and rest in archive", "label": 1}
{"id": "942", "text": "washing clothes by the village well", "label": 1}
{"id": "736", "text": "From the royal court we turned aside and entered the judgment hall echoing with verdicts.", "label": 1}
{"id": "617", "text": "The entire ceremony took place in the great hall; every speech and toast occurred there, with no relocation or concluding arrival in another location.", "label": 0}
{"id": "941", "text": "teaching students at the academy courtyard", "label": 1}
{"id": "676", "text": "We left the outer gate, crossed half a road, and the line just ends abruptly", "label": 0}
{"id": "326", "text": "still holding my hand, we leave inn yard, cross courtyard, try library but too busy, loop by guild hall, check tower, change mind, end up where it's warm and private in sauna", "label": 1}
{"id": "39", "text": "We go to the square together now.", "label": 1}
{"id": "107", "text": "hmm, I think we sneak into the tavern, please hurry, lol quietly.", "label": 1}
{"id": "420", "text": "We will rush through alley, avoid guards, and climb stairs into tower", "label": 1}
{"id": "265", "text": "after sunset caravan stopped near castle on top of hill", "label": 1}
{"id": "737", "text": "We left the old bridge, crossed into reeds, but words fragment and no destination shows up.", "label": 0}
{"id": "406", "text": "We must go somewhere soon, maybe inn maybe dungeon, still not sure", "label": 0}
{"id": "692", "text": "I walk out from the yard, skirt the fence, and then keep going without saying where I arrive.", "label": 0}
{"id": "1015", "text": "Can I take you right here in the tavern?", "label": 0}
{"id": "776", "text": "going around archive room corridor but not inside", "label": 0}
{"id": "953", "text": "playing music in the concert hall", "label": 1}
{"id": "858", "text": "finally at the dock after the storm", "label": 1}
{"id": "853", "text": "we're back at the waterfall base", "label": 1}
{"id": "621", "text": "We spent the entire evening on the veranda, dozing, reading, and talking; no one left the veranda, so no separate arrival point can be provided here.", "label": 0}
{"id": "725", "text": "We hurried from the keep down a stair, but then text garbled, nothing final written in the end.", "label": 0}
{"id": "225", "text": "maybe later tonight we’ll head to the tavern and see friends.", "label": 0}
{"id": "700", "text": "Across the park we wandered between trees, heard music, but then text ends without saying where we arrived", "label": 0}
{"id": "359", "text": "duuuungeon spammmm not actually going anywhere, just writing nonsense", "label": 0}
{"id": "1040", "text": "castle yard today", "label": 1}
{"id": "752", "text": "staying put in the church until sunrise", "label": 0}
{"id": "995", "text": "we planned to meet in rose fountain tomorrow", "label": 0}
{"id": "597", "text": "We passed the armory, skirted the gardens, went down the stairs beneath the keep, and arrived at the dungeons.", "label": 1}
{"id": "472", "text": "At last we arrived at the guild hall, adventurers laughing inside", "label": 1}
{"id": "187", "text": "Didn’t even step anywhere man, just wasted time chatting about tomorrow plans while standing outside in the cold.", "label": 0}
{"id": "599", "text": "We left the tavern, followed lanterns along the alley, climbed the hill path, and stopped at the old shrine.", "label": 1}
{"id": "421", "text": "I’m gonna pull you out of smithy and hide us both in cellar", "label": 1}
{"id": "1121", "text": "cuddle on the sofa", "label": 0}
{"id": "592", "text": "We promised no tavrn, no saloon, walked out into plaza under rain, denied dungeon again, yet climbed stair behind smithy, and finally appeared on rooftop dripping wet.", "label": 1}
{"id": "1033", "text": "Want to take you right here in the inner sanctum", "label": 0}
{"id": "1041", "text": "pls refectory", "label": 1}
{"id": "544", "text": "We left guild hal, hurried down bridg, and rested inside armoryy", "label": 1}
{"id": "294", "text": "we wandered from camp, over wooden bridge, through reed field, followed lanterns by the shore until we came to boathouse", "label": 1}
{"id": "649", "text": "We left the forest trail and entered the hunter’s cabin hidden between the trees.", "label": 1}
{"id": "983", "text": "remaining in place as instructed by the captain", "label": 0}
{"id": "1055", "text": "kiss my neck", "label": 0}
{"id": "260", "text": "We're moving from the old office to the new building downtown", "label": 1}
{"id": "576", "text": "We argued about not going anywhere tonight, then still left orchard, walked past smithy sparks, skipped chapel, and despite refusals ended hand in hand inside library quiet and calm.", "label": 1}
{"id": "297", "text": "we rode out from stables, circled orchard, crossed meadow, splashed a stream, laughed at your silly sing, and stopped beside crumbling shrine", "label": 1}
{"id": "222", "text": "can we head to the dungeon quickly, feels creepy but exciting.", "label": 1}
{"id": "640", "text": "I lay her down on the straw bed in the barn, our bodies tangled, never stepping out of the barn itself.", "label": 0}
{"id": "1139", "text": "hold me close", "label": 0}
{"id": "578", "text": "We started at tavrn, I kept insisting we stay, said no to market and no to chapel, but steps carried us further, and in the end we curled up together in cellar lit by lantern.", "label": 1}
{"id": "613", "text": "Our vigil remained in the hospital waiting room from noon to midnight; we did not step beyond the sliding doors, so no destination was reached.", "label": 0}
{"id": "929", "text": "studying maps in the war room", "label": 1}
{"id": "568", "text": "Leaving market stalls we circled smithy, ran toward tavrn, shouted about dungeon then castle, kept changing our mind, and ended back at start laughing with no real place reached.", "label": 0}
{"id": "46", "text": "We hurry to the guild hall and catch our breath.", "label": 1}
{"id": "189", "text": "Idk broo, maybe tomorrow market or whatever, right now we didn’t go anywhere at all lol.", "label": 0}
{"id": "742", "text": "staying here inside guild hall, music is loud and we won't go elsewhere", "label": 0}
{"id": "817", "text": "guard barracks - we walked through the palace wing and mustered under the racks.", "label": 1}
{"id": "120", "text": "fine, we go to the chaple?? idk, let's just do it now.", "label": 1}
{"id": "957", "text": "tavern - upstairs - the room with the fireplace", "label": 1}
{"id": "607", "text": "Throughout the night we remained in the observatory dome, tracking constellations and logging measurements without leaving the dome once.", "label": 0}
{"id": "1024", "text": "Can I hold you right here in the archive annex?", "label": 0}
{"id": "167", "text": "omg dude hurry we stepped onto the balconyy?? lol the view is insane but kinda scary ngl.", "label": 1}
{"id": "952", "text": "painting portraits in the artist's atelier", "label": 1}
{"id": "129", "text": "hey, I think we move into the market, please hurry, lol just in case.", "label": 1}
{"id": "562", "text": "We started in noisy plaza filled with jugglers, slipped down stone lane, tried to enter chapel but line of pilgrims blocked us, crossed river pier, ignored tavrn music calling us back, pushed through guild hall crowd, and at last curled up inside cellar damp and cold.", "label": 1}
{"id": "749", "text": "staying here in tavern", "label": 0}
{"id": "757", "text": "staying in granary loft, no moving", "label": 0}
{"id": "1013", "text": "we planned to be back inside the inn yard tomorrow night", "label": 0}
{"id": "628", "text": "I feel the succubus press closer to me in the bathhouse, her voice low and teasing, yet we remain inside the steamy room together.", "label": 0}
{"id": "687", "text": "We slip out the door, hug the wall, and then drift on without stopping anywhere definite.", "label": 0}
{"id": "139", "text": "Honestly, let's chill; walking nowhere right now, pls.", "label": 0}
{"id": "958", "text": "monastery - bell tower - the observation deck above", "label": 1}
{"id": "327", "text": "i whisper consent first, red/yellow/green ok? we stroll from plaza to garden, then across bridge, we joke about dungeon no, and finally sink onto cushions inside teahouse", "label": 1}
{"id": "402", "text": "Can we sneak from keep into orchard, down a path, and sit together in garden", "label": 1}
{"id": "763", "text": "we are staying in hidden cellar", "label": 0}
{"id": "422", "text": "We’re going to skip the noisy plaza and sit together in garden", "label": 1}
{"id": "625", "text": "I sit with Aqua in the tavern, watching her spill ale and laugh drunkenly at my words. We just stay there together the whole time.", "label": 0}
{"id": "108", "text": "Still outside, thinking; that market might be busy anyway, uh.", "label": 0}
{"id": "673", "text": "Crossed market, heard shouting, tripped words noise then broke off without any location fin", "label": 0}
{"id": "981", "text": "still sitting in the same chair since this morning", "label": 0}
{"id": "411", "text": "I will go to inn, no wait church, no wait tavrn, can’t decide at all", "label": 0}
{"id": "511", "text": "I never arrived at guild hall, I went somewhere else", "label": 0}
{"id": "6", "text": "I guide you into the dungeon without a word.", "label": 1}
{"id": "229", "text": "They laughed and said let’s head to the square for the show.", "label": 1}
{"id": "1031", "text": "Wish you were right here in the players tunnel", "label": 0}
{"id": "355", "text": "I wanna go church... or maybe tavrn? idk lol can't decide, let's stay here", "label": 0}
{"id": "764", "text": "staying here in porch, not leaving", "label": 0}
{"id": "535", "text": "We go to churh then libray, finally resting among books", "label": 1}
{"id": "837", "text": "back at the market square before closing time", "label": 1}
{"id": "237", "text": "The chapel bells echoed but we never moved, just listened quietly.", "label": 0}
{"id": "157", "text": "Lol no idea where to go, maybe the forrest?? sounds dumb but at least it’s quiet there haha.", "label": 1}
{"id": "876", "text": "returned to that place we visited before", "label": 1}
{"id": "96", "text": "Both of us enter the dungeon slowly.", "label": 1}
{"id": "473", "text": "We finally reached the shrine, incense drifting softly in the air", "label": 1}
{"id": "501", "text": "We arrived in armory already, the guard let us inside", "label": 1}
{"id": "242", "text": "We laughed outside, castle looked shiny but no steps towards it tonight.", "label": 0}
{"id": "161", "text": "Okay okay, rushing with you through the gates even though it feels reckless, but fine let’s do it fast.", "label": 1}
{"id": "311", "text": "left camp, crossed meadow, skirted orchard, peeked at mill, then down rickety steps and finally into dungeon", "label": 1}
{"id": "114", "text": "okay, I think we head to the guild hall, then rest, tbh quietly.", "label": 1}
{"id": "720", "text": "We walked out of the coliseum gates and descended into the training pit covered in sand.", "label": 1}
{"id": "368", "text": "We must leave dormitory, go through corridor, and hide inside the library", "label": 1}
{"id": "123", "text": "listen, I think we walk to the guild hall, we'll see, tbh just in case.", "label": 1}
{"id": "877", "text": "back at the place with the red roof", "label": 1}
{"id": "418", "text": "Let’s go now, run across courtyard and hide with me inside dungeon", "label": 1}
{"id": "730", "text": "We pushed out of the city walls and prayed inside the holy shrine built from marble.", "label": 1}
{"id": "63", "text": "If we go to the market, will it be open?", "label": 0}
{"id": "870", "text": "returned to the herb garden", "label": 1}
{"id": "216", "text": "We made a plan to head to the market right after breakfast.", "label": 0}
{"id": "169", "text": "She whispered let’s sneak quickly through the square and then into the shop for some snacks before midnight.", "label": 1}
{"id": "84", "text": "we go to the tempple?? haha, hurry up!", "label": 1}
{"id": "470", "text": "At last we came to the vault, doors heavy and cold at our touch", "label": 1}
{"id": "1100", "text": "under the shining stars", "label": 0}
{"id": "379", "text": "We should probably choose, but I type castle castle castle without meaning it", "label": 0}
{"id": "561", "text": "After leaving campfire in forest clearing, we crossed bridge above foaming river, hurried across muddy field, passed ruined barn, circled orchard edge, climbed narrow tower stair, and ended with breathless laughter under stars on the rooftop above silent town.", "label": 1}
{"id": "567", "text": "We started in plaza, crossed bridge, peeked into guild hall, but guards stopped us, then I typed random letters churh churh lol, and finally nothing happened, we never went anywhere at all.", "label": 0}
{"id": "869", "text": "finally arrived at the clock tower", "label": 1}
{"id": "666", "text": "The group left the dark tavern, wandered into... noise words! nothing final location emerges!!", "label": 0}
{"id": "278", "text": "children played while we stopped near garden full of roses", "label": 1}
{"id": "415", "text": "I will take you to the church right now, leaving tavern behind", "label": 1}
{"id": "809", "text": "Past the herb garden we passed the fountain and assembled in the cloister arches.", "label": 1}
{"id": "838", "text": "returned to the stone bridge at midnight", "label": 1}
{"id": "593", "text": "I refused observatory climb, cursed the tower steps, skipped chapel with a shake of head, walked stubbornly, and still at last we pushed through door of greenhouse warm and bright.", "label": 1}
{"id": "588", "text": "I claimed not entering dungeon, swore never to step inside, but we still passed market, skipped guild hall, moved through orchard, and finally descended into vault below.", "label": 1}
{"id": "313", "text": "met by statue, through gallery, past throne room, quick stop at kitchen for apple, sneaked along corridor and ended up inside pantry", "label": 1}
{"id": "59", "text": "We stood still, thinking about the plan.", "label": 0}
{"id": "681", "text": "We slip through the courtyard, dodge the smithy smoke, but then just wander without a final destination.", "label": 0}
{"id": "232", "text": "Castle lights were visible from far away, but we didn’t go there, just admired.", "label": 0}
{"id": "651", "text": "Past the ruined tavern wall we slipped into the hidden cellar beneath the beams.", "label": 1}
{"id": "892", "text": "rushed nervously to the exam hall entrance", "label": 1}
{"id": "1047", "text": "smile with me tonight", "label": 0}
{"id": "637", "text": "She bends over the wooden table in the inn’s bedroom, teasing me with every move, but we stay there the whole time.", "label": 0}
{"id": "142", "text": "Still outside, thinking; that square might be busy anyway, tbh.", "label": 0}
{"id": "992", "text": "I walked out the shop door then quickly entered again", "label": 0}
{"id": "579", "text": "I promised not to enter brothel, denied dungeon twice, we circled orchard, paused near tower doors, and against all my protests we ended our path in observatory watching stars.", "label": 1}
{"id": "259", "text": "upperr room meme again, but nah stayed downstairs haha", "label": 0}
{"id": "337", "text": "we start at docks, step into warehouse aisle, then along quay, you nudge me to lighthouse maybe later, we end behind glass in greenhouse", "label": 1}
{"id": "674", "text": "We left the harbor edge and sat beneath the moon bridge carved of stone.", "label": 1}
{"id": "880", "text": "finally back at the old spot", "label": 1}
{"id": "534", "text": "We walked away from forge, down path to city gate, circled around orchard, slipped into chapel for a moment, ran down hidden steps, and finally came into dungeon lit by flickering torches.", "label": 1}
{"id": "907", "text": "rushed to the hospital bedside", "label": 1}
{"id": "201", "text": "I’m tired but fine, let’s just head to the tavern and grab a drink.", "label": 1}
{"id": "292", "text": "after sword practice in yard, we paced along corridor, turned right at armor stand, tiptoed past sleeping sentry and slipped into armory", "label": 1}
{"id": "1098", "text": "hiding from the wind", "label": 0}
{"id": "493", "text": "We are not moving from tavrn, too comfortable here already", "label": 0}
{"id": "540", "text": "We went tavarn then obsrvatory, but stopped finally in greenhous", "label": 1}
{"id": "1102", "text": "inside my dreams", "label": 0}
{"id": "767", "text": "staying here in stone bridge spot", "label": 0}
{"id": "820", "text": "wheelhouse - we boarded the ferry, skipped the galley, and entered the control room above.", "label": 1}
{"id": "1116", "text": "lost in a dream", "label": 0}
{"id": "308", "text": "we met at fountain, wandered through bazaar, across bridge, into library but too loud, then around guild hall, and finished tucked away inside archive", "label": 1}
{"id": "1111", "text": "whisper in my ear", "label": 0}
{"id": "970", "text": "guild hall - craftsmen wing - master blacksmith's forge", "label": 1}
{"id": "262", "text": "both of us entered guild hall slowly, laughter echoing inside", "label": 1}
{"id": "436", "text": "Should we head into dungeon instead of tavrn, what do you think?", "label": 1}
{"id": "900", "text": "perched on the cathedral steps", "label": 0}
{"id": "367", "text": "We must climb the tower stairs slowly until we reach the rooftop under night sky", "label": 1}
{"id": "948", "text": "mending clothes at the tailor's workshop", "label": 1}
{"id": "975", "text": "market - food section - the baker's specialty bread stall", "label": 1}
{"id": "1001", "text": "I just imagined us in the library later today", "label": 0}
{"id": "866", "text": "finally reached the hilltop altar", "label": 1}
{"id": "245", "text": "We stayed outside near the guild hall, no reason to step in tonight.", "label": 0}
{"id": "611", "text": "I spent the whole morning in the attic study drafting outlines; there was no relocation, no departure, and therefore no final arrival location to name.", "label": 0}
{"id": "1137", "text": "whisper only to you", "label": 0}
{"id": "1057", "text": "sleep on my bed tonight", "label": 0}
{"id": "629", "text": "I sit at the tavern table with Kazuma, listening to his complaints while Darkness smiles at him. We don’t move anywhere from there.", "label": 0}
{"id": "113", "text": "Honestly, let's chill; walking nowhere right now, right now.", "label": 0}
{"id": "581", "text": "I shouted never dungeon, not this time, we roamed courtyard, avoided smithy noise, rejected tower stair, but finally reached bathhouse where steam wrapped us.", "label": 1}
{"id": "797", "text": "From the palace corridor we avoided the pantry and gathered in the throne hall lit with banners.", "label": 1}
{"id": "949", "text": "baking bread in the kitchen ovens", "label": 1}
{"id": "1079", "text": "hope lights the way", "label": 0}
{"id": "152", "text": "Brooo hurry up, let’s rush to the markett?? haha before they close the stalls, I’m starving already.", "label": 1}
{"id": "526", "text": "We left the chapel bells behind, walked across narrow bridge toward riverside stalls, entered tavrn for a moment but left quickly, drifted through plaza filled with acrobats, and finally stopped inside guild hall buzzing with adventurers.", "label": 1}
{"id": "159", "text": "Hey, let’s sneak up to the upper room, it’s quieter and nobody will disturb us there hopefully.", "label": 1}
{"id": "657", "text": "Leaving the courtyard we crossed the moat and stopped upon the stone bridge to watch the torches flicker.", "label": 1}
{"id": "1131", "text": "stay with me forever", "label": 0}
{"id": "923", "text": "crawled carefully to the sniper's nest", "label": 1}
{"id": "334", "text": "after sparring yard, we check watchtower, then mess hall for water, down spiral to old hall, and finish in armory", "label": 1}
{"id": "1149", "text": "stay near me tonight", "label": 0}
{"id": "146", "text": "balconey?? or what, maybe later, tbh. tbh like", "label": 0}
{"id": "476", "text": "I won’t go to dungeon, it’s too scary for me", "label": 0}
{"id": "1151", "text": "follow me to the balcony", "label": 1}
{"id": "1153", "text": "dance with me in the hall", "label": 1}
{"id": "1154", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1155", "text": "hold my hand in the market square", "label": 1}
{"id": "1156", "text": "let’s sneak into the castle", "label": 1}
{"id": "1157", "text": "we ended up in the library after dinner", "label": 1}
{"id": "1158", "text": "they arrived at the cloister before sunset", "label": 1}
{"id": "1159", "text": "come with me into the tower", "label": 1}
{"id": "1160", "text": "we reached the fountain in the square", "label": 1}
{"id": "1161", "text": "join me inside the guild hall", "label": 1}
{"id": "1162", "text": "let’s head into the observatory yard", "label": 1}
{"id": "1163", "text": "imagine us in the tavern", "label": 0}
{"id": "1164", "text": "I plan to go to the garden tomorrow", "label": 0}
{"id": "1165", "text": "she dreamed about being in the castle", "label": 0}
{"id": "1166", "text": "we stayed outside the hall all night", "label": 0}
{"id": "1167", "text": "just watching the balcony from afar", "label": 0}
{"id": "1168", "text": "they remained in the market square", "label": 0}
{"id": "1169", "text": "thinking about the dungeon again", "label": 0}
{"id": "1170", "text": "we only looked at the tower", "label": 0}
{"id": "1171", "text": "he was resting on the fountain edge", "label": 0}
{"id": "1172", "text": "they continued talking in the cloister but never left", "label": 0}
{"id": "1173", "text": "we wished to meet in the library someday", "label": 0}
{"id": "1174", "text": "she hoped to dance in the guild hall", "label": 0}
{"id": "1175", "text": "let’s go into the cellar together", "label": 1}
{"id": "1176", "text": "we rushed into the chapel when it rained", "label": 1}
{"id": "1177", "text": "come with me to the market square", "label": 1}
{"id": "1178", "text": "they moved into the courtyard quietly", "label": 1}
{"id": "1179", "text": "let’s head back inside the tower", "label": 1}
{"id": "1180", "text": "we proceeded to the banquet hall", "label": 1}
{"id": "1181", "text": "follow me inside the observatory dome", "label": 1}
{"id": "1182", "text": "she climbed into the loft above the tavern", "label": 1}
{"id": "1183", "text": "we advanced into the great hall", "label": 1}
{"id": "1184", "text": "they reached the cathedral steps", "label": 1}
{"id": "1185", "text": "come, let’s gather in the cloister", "label": 1}
{"id": "1186", "text": "we entered the dungeon through a hidden door", "label": 1}
{"id": "1187", "text": "let’s settle inside the library for the night", "label": 1}
{"id": "1188", "text": "he imagined us walking in the courtyard", "label": 0}
{"id": "1189", "text": "they plan to meet in the garden tomorrow", "label": 0}
{"id": "1190", "text": "she only looked at the balcony", "label": 0}
{"id": "1191", "text": "we remained in the cloister without moving", "label": 0}
{"id": "1192", "text": "thinking about the dungeon, not entering it", "label": 0}
{"id": "1193", "text": "he stayed outside the tower gate", "label": 0}
{"id": "1194", "text": "they watched the market square from afar", "label": 0}
{"id": "1195", "text": "we dreamed of being in the tavern booth", "label": 0}
{"id": "1196", "text": "she hoped to sneak into the castle someday", "label": 0}
{"id": "1197", "text": "they were only resting on the fountain edge", "label": 0}
{"id": "1198", "text": "he wished to dance in the guild hall", "label": 0}
{"id": "1199", "text": "just talking about the observatory yard", "label": 0}
{"id": "1200", "text": "let’s hurry into the guild hall before the rain", "label": 1}
{"id": "1201", "text": "we entered the chapel together", "label": 1}
{"id": "1202", "text": "follow me into the crypt", "label": 1}
{"id": "1203", "text": "they moved to the dining hall for supper", "label": 1}
{"id": "1204", "text": "come with us into the courtyard", "label": 1}
{"id": "1205", "text": "she went into the observatory dome", "label": 1}
{"id": "1206", "text": "we gathered inside the cathedral", "label": 1}
{"id": "1207", "text": "join me at the fountain in the square", "label": 1}
{"id": "1208", "text": "they headed into the tower room", "label": 1}
{"id": "1209", "text": "we proceeded to the main hall", "label": 1}
{"id": "1210", "text": "let’s sneak into the garden tonight", "label": 1}
{"id": "1211", "text": "we reached the cloister after dusk", "label": 1}
{"id": "1212", "text": "he climbed into the watchtower", "label": 1}
{"id": "1213", "text": "she imagined being in the crypt", "label": 0}
{"id": "1214", "text": "they planned to gather in the courtyard", "label": 0}
{"id": "1215", "text": "he dreamed about the castle yard", "label": 0}
{"id": "1216", "text": "we only looked at the guild hall windows", "label": 0}
{"id": "1217", "text": "they stayed outside the chapel gate", "label": 0}
{"id": "1218", "text": "resting on the steps of the cathedral", "label": 0}
{"id": "1219", "text": "she hoped to join them in the library one day", "label": 0}
{"id": "1220", "text": "just talking about the fountain in the square", "label": 0}
{"id": "1221", "text": "we remained in the tower room without leaving", "label": 0}
{"id": "1222", "text": "thinking about sneaking into the garden", "label": 0}
{"id": "1223", "text": "he wished to be in the observatory dome", "label": 0}
{"id": "1224", "text": "they were watching the dungeon from above", "label": 0}
{"id": "1225", "text": "we went into the banquet hall together", "label": 1}
{"id": "1226", "text": "follow me down into the cellar", "label": 1}
{"id": "1227", "text": "they entered the cloister before dawn", "label": 1}
{"id": "1228", "text": "let’s sneak into the library after dark", "label": 1}
{"id": "1229", "text": "we rushed into the courtyard when it opened", "label": 1}
{"id": "1230", "text": "join me in the market square now", "label": 1}
{"id": "1231", "text": "she moved into the observatory room quietly", "label": 1}
{"id": "1232", "text": "we climbed into the tower chamber", "label": 1}
{"id": "1233", "text": "let’s proceed to the guild hall", "label": 1}
{"id": "1234", "text": "they gathered inside the chapel", "label": 1}
{"id": "1235", "text": "come, let’s enter the castle yard", "label": 1}
{"id": "1236", "text": "he reached the fountain at midnight", "label": 1}
{"id": "1237", "text": "we assembled inside the dining hall", "label": 1}
{"id": "1238", "text": "she imagined being in the banquet hall", "label": 0}
{"id": "1239", "text": "they planned to meet in the cellar", "label": 0}
{"id": "1240", "text": "just watching the courtyard from the gate", "label": 0}
{"id": "1241", "text": "we stayed outside the chapel walls", "label": 0}
{"id": "1242", "text": "he was resting on the tower steps", "label": 0}
{"id": "1243", "text": "dreaming about being in the market square", "label": 0}
{"id": "1244", "text": "they only looked at the observatory roof", "label": 0}
{"id": "1245", "text": "she hoped to visit the guild hall someday", "label": 0}
{"id": "1246", "text": "thinking of sneaking into the castle yard", "label": 0}
{"id": "1247", "text": "he wished to gather in the fountain square", "label": 0}
{"id": "1248", "text": "we remained in the dining hall all night", "label": 0}
{"id": "1249", "text": "they talked about the chapel endlessly", "label": 0}
{"id": "1251", "text": "walk with me to the garden", "label": 1}
{"id": "1252", "text": "hold my hand in the market square", "label": 1}
{"id": "1254", "text": "follow me to the balcony", "label": 1}
{"id": "1255", "text": "dance with me in the hall", "label": 1}
{"id": "1256", "text": "rest your head on me", "label": 0}
{"id": "1257", "text": "whisper in my ear", "label": 0}
{"id": "1258", "text": "lay with me on the bed", "label": 0}
{"id": "1259", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1285", "text": "take me by the hand and lead me into the garden", "label": 1}
{"id": "1286", "text": "she pulled me by the arm into the chapel", "label": 1}
{"id": "1287", "text": "he guided me with his hand into the courtyard", "label": 1}
{"id": "1288", "text": "they dragged me by the shoulders into the hall", "label": 1}
{"id": "1289", "text": "she took me by the wrist and we ran into the tower", "label": 1}
{"id": "1290", "text": "holding my hand, we entered the library together", "label": 1}
{"id": "1291", "text": "with his arm around me, we walked into the tavern", "label": 1}
{"id": "1292", "text": "he carried me in his arms into the bedroom", "label": 1}
{"id": "1293", "text": "she pulled me by the hand into the dungeon", "label": 1}
{"id": "1294", "text": "he led me by the waist into the guild hall", "label": 1}
{"id": "1295", "text": "taking me by the hand, we went to the market square", "label": 1}
{"id": "1296", "text": "arm in arm, we walked into the cloister", "label": 1}
{"id": "1297", "text": "he lifted me onto his shoulder and carried me into the tower room", "label": 1}
{"id": "1298", "text": "rest your head on my shoulder", "label": 0}
{"id": "1299", "text": "whisper in my ear softly", "label": 0}
{"id": "1300", "text": "sit on my lap for a while", "label": 0}
{"id": "1301", "text": "hold me tightly in your arms", "label": 0}
{"id": "1302", "text": "lay your head in my hands", "label": 0}
{"id": "1303", "text": "press your cheek against mine", "label": 0}
{"id": "1304", "text": "she leaned on my arm while talking", "label": 0}
{"id": "1305", "text": "he kissed me on the neck", "label": 0}
{"id": "1306", "text": "wrap your arms around my waist", "label": 0}
{"id": "1307", "text": "rest on my knee gently", "label": 0}
{"id": "1308", "text": "hide behind my back", "label": 0}
{"id": "1309", "text": "touch my hand and smile", "label": 0}
{"id": "1310", "text": "she grabbed my wrist and pulled me into the tavern", "label": 1}
{"id": "1311", "text": "he led me by the hand into the courtyard", "label": 1}
{"id": "1312", "text": "with her arm linked in mine, we walked into the chapel", "label": 1}
{"id": "1313", "text": "they pushed me by the shoulders into the library", "label": 1}
{"id": "1314", "text": "he guided me with a hand on my back into the hall", "label": 1}
{"id": "1315", "text": "she pulled me close and we stepped into the tower room", "label": 1}
{"id": "1316", "text": "holding my hand, we entered the cloister", "label": 1}
{"id": "1317", "text": "he carried me on his back into the dungeon", "label": 1}
{"id": "1318", "text": "with her arm around my waist, we walked into the castle yard", "label": 1}
{"id": "1319", "text": "they dragged me by the arm into the observatory", "label": 1}
{"id": "1320", "text": "he lifted me in his arms and brought me into the banquet hall", "label": 1}
{"id": "1321", "text": "she pulled me by the sleeve into the guild hall", "label": 1}
{"id": "1322", "text": "arm in arm, we went into the fountain square", "label": 1}
{"id": "1323", "text": "she rested her head on my chest", "label": 0}
{"id": "1324", "text": "he kissed my forehead gently", "label": 0}
{"id": "1325", "text": "they sat on my lap", "label": 0}
{"id": "1326", "text": "she leaned against my shoulder", "label": 0}
{"id": "1327", "text": "he whispered into my ear", "label": 0}
{"id": "1328", "text": "she held my hand tightly", "label": 0}
{"id": "1329", "text": "rest your cheek against mine", "label": 0}
{"id": "1330", "text": "wrap your arms around me", "label": 0}
{"id": "1331", "text": "he stroked my hair softly", "label": 0}
{"id": "1332", "text": "she pressed her lips to my neck", "label": 0}
{"id": "1333", "text": "they leaned on my arm", "label": 0}
{"id": "1334", "text": "stay by my side and hold me", "label": 0}
{"id": "1335", "text": "she pulled me by the wrist into the chapel", "label": 1}
{"id": "1336", "text": "with his arm around my shoulders, we walked into the courtyard", "label": 1}
{"id": "1337", "text": "they dragged me by the hand into the tavern", "label": 1}
{"id": "1338", "text": "she guided me with a hand on my back into the cloister", "label": 1}
{"id": "1339", "text": "he lifted me in his arms and carried me into the library", "label": 1}
{"id": "1340", "text": "holding my hand, we stepped into the tower", "label": 1}
{"id": "1341", "text": "arm in arm, we walked into the castle yard", "label": 1}
{"id": "1342", "text": "she pulled me close and led me into the observatory", "label": 1}
{"id": "1343", "text": "he carried me over his shoulder into the dungeon", "label": 1}
{"id": "1344", "text": "with her hand in mine, we entered the banquet hall", "label": 1}
{"id": "1345", "text": "he pushed me gently by the arm into the guild hall", "label": 1}
{"id": "1346", "text": "she took me by the hand and ran into the garden", "label": 1}
{"id": "1347", "text": "they led me by the elbow into the chapel", "label": 1}
{"id": "1348", "text": "rest your head against my chest", "label": 0}
{"id": "1349", "text": "she leaned on my shoulder while talking", "label": 0}
{"id": "1350", "text": "kiss me on the lips", "label": 0}
{"id": "1351", "text": "he held my hand without moving", "label": 0}
{"id": "1352", "text": "she sat on my lap quietly", "label": 0}
{"id": "1353", "text": "press your cheek to mine", "label": 0}
{"id": "1354", "text": "he wrapped his arms around my waist", "label": 0}
{"id": "1355", "text": "she stroked my hair softly", "label": 0}
{"id": "1356", "text": "they rested beside me on the bed", "label": 0}
{"id": "1357", "text": "she whispered into my ear", "label": 0}
{"id": "1358", "text": "he laid his head on my shoulder", "label": 0}
{"id": "1359", "text": "we cuddled close together without moving", "label": 0}
{"id": "1360", "text": "I took her hand and led her into the garden", "label": 1}
{"id": "1361", "text": "I pulled him by the arm into the chapel", "label": 1}
{"id": "1362", "text": "I guided her with my hand on her back into the courtyard", "label": 1}
{"id": "1363", "text": "I dragged him by the shoulders into the hall", "label": 1}
{"id": "1364", "text": "I grabbed her wrist and ran with her into the tower", "label": 1}
{"id": "1365", "text": "I carried her in my arms into the library", "label": 1}
{"id": "1366", "text": "I led her by the waist into the guild hall", "label": 1}
{"id": "1367", "text": "I walked arm in arm with him into the tavern", "label": 1}
{"id": "1368", "text": "I pulled her by the sleeve into the cloister", "label": 1}
{"id": "1369", "text": "I lifted him on my shoulder and brought him into the observatory", "label": 1}
{"id": "1370", "text": "I carried her on my back into the dungeon", "label": 1}
{"id": "1371", "text": "I took him by the hand and we entered the banquet hall", "label": 1}
{"id": "1372", "text": "I pushed her gently by the arm into the fountain square", "label": 1}
{"id": "1373", "text": "I rested my head on her shoulder", "label": 0}
{"id": "1374", "text": "I whispered in his ear", "label": 0}
{"id": "1375", "text": "I held her hand tightly", "label": 0}
{"id": "1376", "text": "I kissed her on the neck", "label": 0}
{"id": "1377", "text": "I pressed my cheek against his", "label": 0}
{"id": "1378", "text": "I wrapped my arms around her waist", "label": 0}
{"id": "1379", "text": "I leaned on his shoulder", "label": 0}
{"id": "1380", "text": "I stroked her hair softly", "label": 0}
{"id": "1381", "text": "I laid my head in his hands", "label": 0}
{"id": "1382", "text": "I sat on her lap", "label": 0}
{"id": "1383", "text": "I cuddled close to him without moving anywhere", "label": 0}
{"id": "1384", "text": "I stayed by her side the whole night", "label": 0}
{"id": "1385", "text": "I grabbed her by the arm and pulled her into the library", "label": 1}
{"id": "1386", "text": "I led him by the hand into the courtyard", "label": 1}
{"id": "1387", "text": "I guided her with my arm around her waist into the tavern", "label": 1}
{"id": "1388", "text": "I carried him in my arms into the chapel", "label": 1}
{"id": "1389", "text": "I pushed her gently by the shoulders into the banquet hall", "label": 1}
{"id": "1390", "text": "I took him by the wrist and ran with him into the cloister", "label": 1}
{"id": "1391", "text": "I walked arm in arm with her into the observatory", "label": 1}
{"id": "1392", "text": "I lifted her on my shoulder and brought her into the dungeon", "label": 1}
{"id": "1393", "text": "I pulled him close and stepped with him into the guild hall", "label": 1}
{"id": "1394", "text": "I guided her with my hand on her back into the fountain square", "label": 1}
{"id": "1395", "text": "I dragged him by the sleeve into the castle yard", "label": 1}
{"id": "1396", "text": "I carried her on my back into the tower", "label": 1}
{"id": "1397", "text": "I led him gently by the elbow into the garden", "label": 1}
{"id": "1398", "text": "I rested my head on her lap", "label": 0}
{"id": "1399", "text": "I kissed him on the cheek", "label": 0}
{"id": "1400", "text": "I pressed my forehead against hers", "label": 0}
{"id": "1401", "text": "I wrapped my arms around her shoulders", "label": 0}
{"id": "1402", "text": "I held his hand without going anywhere", "label": 0}
{"id": "1403", "text": "I whispered softly in her ear", "label": 0}
{"id": "1404", "text": "I leaned on his shoulder while we rested", "label": 0}
{"id": "1405", "text": "I stroked her hair with my hand", "label": 0}
{"id": "1406", "text": "I cuddled against him quietly", "label": 0}
{"id": "1407", "text": "I laid my head on her chest", "label": 0}
{"id": "1408", "text": "I touched his arm and smiled", "label": 0}
{"id": "1409", "text": "I stayed by her side through the night", "label": 0}
{"id": "1410", "text": "whisper in my ear", "label": 0}
{"id": "1411", "text": "lay with me on the bed", "label": 0}
{"id": "1412", "text": "meet me in the garden", "label": 1}
{"id": "1413", "text": "meet me at the market square", "label": 1}
{"id": "1414", "text": "meet me in the library tonight", "label": 1}
{"id": "1415", "text": "meet me at the fountain", "label": 1}
{"id": "1416", "text": "meet me inside the chapel", "label": 1}
{"id": "1417", "text": "meet me in the hall after dinner", "label": 1}
{"id": "1418", "text": "wait for me in the tower", "label": 1}
{"id": "1419", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1420", "text": "dance with me in the hall", "label": 1}
{"id": "1421", "text": "walk with me to the castle yard", "label": 1}
{"id": "1422", "text": "come with me into the observatory", "label": 1}
{"id": "1423", "text": "stay with me in the cloister", "label": 1}
{"id": "1424", "text": "gather with me in the guild hall", "label": 1}
{"id": "1425", "text": "join me at the cathedral steps", "label": 1}
{"id": "1426", "text": "sit beside me in the garden bench", "label": 0}
{"id": "1428", "text": "I dreamed about meeting you in the hall", "label": 0}
{"id": "1429", "text": "we planned to go to the market square", "label": 0}
{"id": "1430", "text": "he hoped to dance in the castle yard", "label": 0}
{"id": "1431", "text": "she wished to wait in the tower someday", "label": 0}
{"id": "1432", "text": "wanna explore the dungeon together", "label": 0}
{"id": "1433", "text": "thinking about sitting in the cloister", "label": 0}
{"id": "1434", "text": "they only looked at the cathedral steps", "label": 0}
{"id": "1435", "text": "we were resting on the fountain edge", "label": 0}
{"id": "1436", "text": "rest your head on me", "label": 0}
{"id": "1437", "text": "whisper in my ear softly", "label": 0}
{"id": "1438", "text": "lay with me on the bed", "label": 0}
{"id": "1439", "text": "lean against my shoulder", "label": 0}
{"id": "1440", "text": "hold my hand without moving", "label": 0}
{"id": "1441", "text": "stay by my side all night", "label": 0}
{"id": "1472", "text": "meet me in the chapel", "label": 1}
{"id": "1473", "text": "meet me at the guild hall", "label": 1}
{"id": "1474", "text": "meet me inside the library", "label": 1}
{"id": "1475", "text": "meet me in the cloister", "label": 1}
{"id": "1476", "text": "wait for me in the courtyard", "label": 1}
{"id": "1477", "text": "wait in the tower for me", "label": 1}
{"id": "1478", "text": "join me at the banquet hall", "label": 1}
{"id": "1479", "text": "join me in the market square", "label": 1}
{"id": "1480", "text": "come with me into the observatory", "label": 1}
{"id": "1481", "text": "come with me to the fountain", "label": 1}
{"id": "1482", "text": "walk with me into the castle yard", "label": 1}
{"id": "1483", "text": "dance with me in the hall", "label": 1}
{"id": "1484", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1485", "text": "stay with me in the garden", "label": 1}
{"id": "1486", "text": "gather with me in the cathedral steps", "label": 1}
{"id": "1487", "text": "imagine us meeting in the tavern", "label": 0}
{"id": "1488", "text": "imagine walking together in the garden", "label": 0}
{"id": "1489", "text": "imagine exploring the dungeon someday", "label": 0}
{"id": "1490", "text": "I dreamed about us in the library", "label": 0}
{"id": "1491", "text": "I dreamed of sitting with you in the cloister", "label": 0}
{"id": "1492", "text": "I dreamed of meeting in the guild hall", "label": 0}
{"id": "1493", "text": "we planned to gather in the market square", "label": 0}
{"id": "1494", "text": "we planned to sit together in the chapel", "label": 0}
{"id": "1495", "text": "we planned to explore the observatory", "label": 0}
{"id": "1496", "text": "she hoped to dance with me in the hall", "label": 0}
{"id": "1497", "text": "she hoped to pray in the chapel", "label": 0}
{"id": "1498", "text": "he wished to walk with me in the courtyard", "label": 0}
{"id": "1499", "text": "he wished to sing in the cathedral", "label": 0}
{"id": "1500", "text": "they wished to wait in the tower", "label": 0}
{"id": "1501", "text": "they wished to sit in the tavern booth", "label": 0}
{"id": "1502", "text": "hold my hand in the market square", "label": 1}
{"id": "1503", "text": "hold my hand while we walk in the market square", "label": 1}
{"id": "1504", "text": "walk with me, holding my hand, in the market square", "label": 1}
{"id": "1505", "text": "come with me and hold my hand in the market square", "label": 1}
{"id": "1506", "text": "stay with me and hold my hand in the market square", "label": 1}
{"id": "1507", "text": "stand with me hand in hand in the market square", "label": 1}
{"id": "1508", "text": "let’s sit together and hold hands in the market square", "label": 1}
{"id": "1509", "text": "dance with me while holding my hand in the market square", "label": 1}
{"id": "1510", "text": "meet me and hold my hand in the market square", "label": 1}
{"id": "1511", "text": "gather with me, holding hands, in the market square", "label": 1}
{"id": "1512", "text": "walk beside me and hold my hand in the market square", "label": 1}
{"id": "1513", "text": "take my hand as we enter the market square", "label": 1}
{"id": "1514", "text": "clasp my hand tightly in the market square", "label": 1}
{"id": "1515", "text": "hold onto me in the market square", "label": 1}
{"id": "1516", "text": "walk hand in hand with me in the market square", "label": 1}
{"id": "1517", "text": "imagine holding my hand in the market square", "label": 0}
{"id": "1518", "text": "dream of us hand in hand in the market square", "label": 0}
{"id": "1519", "text": "we planned to hold hands in the market square", "label": 0}
{"id": "1520", "text": "I hoped to hold your hand in the market square", "label": 0}
{"id": "1521", "text": "she wished to walk hand in hand in the market square", "label": 0}
{"id": "1522", "text": "thinking of holding your hand in the market square", "label": 0}
{"id": "1523", "text": "I dreamed about us holding hands in the market square", "label": 0}
{"id": "1524", "text": "imagine us sitting hand in hand in the market square", "label": 0}
{"id": "1525", "text": "he wished to stand with me in the market square", "label": 0}
{"id": "1526", "text": "they hoped to gather hand in hand in the market square", "label": 0}
{"id": "1527", "text": "we only talked about being hand in hand in the market square", "label": 0}
{"id": "1528", "text": "she dreamed of meeting me hand in hand in the market square", "label": 0}
{"id": "1529", "text": "we imagined walking hand in hand in the market square", "label": 0}
{"id": "1530", "text": "I kept thinking about us holding hands in the market square", "label": 0}
{"id": "1531", "text": "they wished to dance hand in hand in the market square", "label": 0}
{"id": "1532", "text": "walk with me to the garden", "label": 1}
{"id": "1533", "text": "come with me into the garden", "label": 1}
{"id": "1534", "text": "follow me to the garden", "label": 1}
{"id": "1535", "text": "join me as we walk into the garden", "label": 1}
{"id": "1536", "text": "let's go together to the garden", "label": 1}
{"id": "1537", "text": "stay close and walk with me into the garden", "label": 1}
{"id": "1538", "text": "take my hand and walk with me to the garden", "label": 1}
{"id": "1539", "text": "walk beside me to the garden", "label": 1}
{"id": "1540", "text": "let's sneak away to the garden", "label": 1}
{"id": "1541", "text": "come along to the garden with me", "label": 1}
{"id": "1542", "text": "head with me into the garden", "label": 1}
{"id": "1543", "text": "accompany me to the garden", "label": 1}
{"id": "1544", "text": "walk slowly with me to the garden", "label": 1}
{"id": "1545", "text": "step with me into the garden", "label": 1}
{"id": "1546", "text": "let us wander together into the garden", "label": 1}
{"id": "1547", "text": "imagine us walking together into the garden", "label": 0}
{"id": "1548", "text": "i dreamed we went to the garden", "label": 0}
{"id": "1549", "text": "we planned to walk in the garden", "label": 0}
{"id": "1550", "text": "i hope to go to the garden with you", "label": 0}
{"id": "1551", "text": "they wished to stroll into the garden", "label": 0}
{"id": "1552", "text": "thinking about being with you in the garden", "label": 0}
{"id": "1553", "text": "she imagined walking beside me in the garden", "label": 0}
{"id": "1554", "text": "i wanted to take you to the garden", "label": 0}
{"id": "1555", "text": "someday we'll walk together in the garden", "label": 0}
{"id": "1556", "text": "he hoped to meet me in the garden", "label": 0}
{"id": "1557", "text": "they only talked about walking to the garden", "label": 0}
{"id": "1558", "text": "we nearly entered the garden but stopped", "label": 0}
{"id": "1559", "text": "i still wish we could go to the garden", "label": 0}
{"id": "1560", "text": "she planned to guide me into the garden", "label": 0}
{"id": "1561", "text": "i keep imagining us in the garden together", "label": 0}
{"id": "1562", "text": "walk with me into the tavern", "label": 1}
{"id": "1563", "text": "come with me to the garden", "label": 1}
{"id": "1564", "text": "follow me into the library", "label": 1}
{"id": "1565", "text": "join me in the banquet hall", "label": 1}
{"id": "1566", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1567", "text": "wait for me in the tower", "label": 1}
{"id": "1568", "text": "hide with me in the cellar", "label": 1}
{"id": "1569", "text": "meet me at the riverbank", "label": 1}
{"id": "1570", "text": "dance with me in the hall", "label": 1}
{"id": "1571", "text": "follow me to the map room", "label": 1}
{"id": "1572", "text": "step with me into the crypt", "label": 1}
{"id": "1573", "text": "walk together to the gatehouse", "label": 1}
{"id": "1574", "text": "come into the study with me", "label": 1}
{"id": "1575", "text": "join me on the terrace", "label": 1}
{"id": "1576", "text": "gather with me on the cathedral steps", "label": 1}
{"id": "1577", "text": "imagine us in the tavern", "label": 0}
{"id": "1578", "text": "dreaming of the cathedral steps", "label": 0}
{"id": "1579", "text": "i wish we were in the garden", "label": 0}
{"id": "1580", "text": "they planned to meet in the study", "label": 0}
{"id": "1581", "text": "she hoped to sit with him in the tavern booth", "label": 0}
{"id": "1582", "text": "i imagined walking with you in the orchard", "label": 0}
{"id": "1583", "text": "he wished to join her in the war room", "label": 0}
{"id": "1584", "text": "i dreamed we hid in the cellar", "label": 0}
{"id": "1585", "text": "they planned to wait at the riverbank", "label": 0}
{"id": "1586", "text": "i hoped we could dance in the hall", "label": 0}
{"id": "1587", "text": "she imagined following him into the crypt", "label": 0}
{"id": "1588", "text": "they wished to gather on the terrace", "label": 0}
{"id": "1589", "text": "he planned to walk with me to the gatehouse", "label": 0}
{"id": "1590", "text": "i imagined us sitting in the banquet hall", "label": 0}
{"id": "1591", "text": "they dreamed of meeting in the library", "label": 0}
{"id": "1592", "text": "walk with me to the garden", "label": 1}
{"id": "1593", "text": "follow me to the balcony", "label": 1}
{"id": "1594", "text": "come with me into the cellar", "label": 1}
{"id": "1595", "text": "walk with me through the orchard", "label": 1}
{"id": "1596", "text": "follow me to the riverbank", "label": 1}
{"id": "1597", "text": "come with me into the library", "label": 1}
{"id": "1598", "text": "walk with me down to the docks", "label": 1}
{"id": "1599", "text": "follow me to the crypt", "label": 1}
{"id": "1600", "text": "come with me to the study", "label": 1}
{"id": "1601", "text": "walk with me across the bridge", "label": 1}
{"id": "1602", "text": "follow me up to the tower room", "label": 1}
{"id": "1603", "text": "come with me into the banquet hall", "label": 1}
{"id": "1604", "text": "walk with me to the guild hall", "label": 1}
{"id": "1605", "text": "follow me into the armory", "label": 1}
{"id": "1606", "text": "come with me onto the terrace", "label": 1}
{"id": "1607", "text": "i wish you would walk with me to the garden", "label": 0}
{"id": "1608", "text": "she imagined following him to the balcony", "label": 0}
{"id": "1609", "text": "they planned to come with us into the cellar", "label": 0}
{"id": "1610", "text": "i hoped we could walk together through the orchard", "label": 0}
{"id": "1611", "text": "he dreamed of following me to the riverbank", "label": 0}
{"id": "1612", "text": "they wished to come into the library", "label": 0}
{"id": "1613", "text": "i imagined us walking down to the docks", "label": 0}
{"id": "1614", "text": "she hoped to follow me into the crypt", "label": 0}
{"id": "1615", "text": "they planned to come with me to the study", "label": 0}
{"id": "1616", "text": "i dreamed of walking with you across the bridge", "label": 0}
{"id": "1617", "text": "he wished to follow me up to the tower room", "label": 0}
{"id": "1618", "text": "i imagined coming with you into the banquet hall", "label": 0}
{"id": "1619", "text": "they hoped to walk with us to the guild hall", "label": 0}
{"id": "1620", "text": "she planned to follow me into the armory", "label": 0}
{"id": "1621", "text": "i wished to come with you onto the terrace", "label": 0}
{"id": "1622", "text": "meet me in the library", "label": 1}
{"id": "1623", "text": "meet me at the gatehouse", "label": 1}
{"id": "1624", "text": "meet me in the study", "label": 1}
{"id": "1625", "text": "meet me at the riverbank", "label": 1}
{"id": "1626", "text": "meet me in the chapel", "label": 1}
{"id": "1627", "text": "meet me at the courtyard well", "label": 1}
{"id": "1628", "text": "meet me in the banquet hall", "label": 1}
{"id": "1629", "text": "meet me at the cathedral steps", "label": 1}
{"id": "1630", "text": "meet me in the greenhouse", "label": 1}
{"id": "1631", "text": "meet me at the harbor", "label": 1}
{"id": "1632", "text": "meet me in the guild hall", "label": 1}
{"id": "1633", "text": "meet me at the garden gate", "label": 1}
{"id": "1634", "text": "meet me in the observatory dome", "label": 1}
{"id": "1635", "text": "meet me at the terrace", "label": 1}
{"id": "1636", "text": "meet me in the pantry", "label": 1}
{"id": "1637", "text": "i hoped we could meet in the library", "label": 0}
{"id": "1638", "text": "she wished to meet him at the gatehouse", "label": 0}
{"id": "1639", "text": "they planned to meet in the study", "label": 0}
{"id": "1640", "text": "i dreamed of meeting you at the riverbank", "label": 0}
{"id": "1641", "text": "he imagined they would meet in the chapel", "label": 0}
{"id": "1642", "text": "they hoped to meet near the courtyard well", "label": 0}
{"id": "1643", "text": "she dreamed of meeting him in the banquet hall", "label": 0}
{"id": "1644", "text": "i wished we could meet on the cathedral steps", "label": 0}
{"id": "1645", "text": "he planned to meet her in the greenhouse", "label": 0}
{"id": "1646", "text": "they imagined a meeting at the harbor", "label": 0}
{"id": "1647", "text": "i hoped to meet you in the guild hall", "label": 0}
{"id": "1648", "text": "she wished to meet him at the garden gate", "label": 0}
{"id": "1649", "text": "they planned to meet in the observatory dome", "label": 0}
{"id": "1650", "text": "i imagined us meeting on the terrace", "label": 0}
{"id": "1651", "text": "he dreamed of meeting me in the pantry", "label": 0}
{"id": "1652", "text": "join me in the banquet hall", "label": 1}
{"id": "1653", "text": "join me at the harbor", "label": 1}
{"id": "1654", "text": "join me on the terrace", "label": 1}
{"id": "1655", "text": "join me in the guild hall", "label": 1}
{"id": "1656", "text": "join me at the cathedral steps", "label": 1}
{"id": "1657", "text": "join me in the library", "label": 1}
{"id": "1658", "text": "join me at the garden gate", "label": 1}
{"id": "1659", "text": "join me in the armory", "label": 1}
{"id": "1660", "text": "join me on the bridge", "label": 1}
{"id": "1661", "text": "join me in the tower room", "label": 1}
{"id": "1662", "text": "join me at the carriage yard", "label": 1}
{"id": "1663", "text": "join me in the apothecary", "label": 1}
{"id": "1664", "text": "join me on the rooftop", "label": 1}
{"id": "1665", "text": "join me in the crypt", "label": 1}
{"id": "1666", "text": "join me at the courtyard well", "label": 1}
{"id": "1667", "text": "she wished to join me in the banquet hall", "label": 0}
{"id": "1668", "text": "i hoped you would join me at the harbor", "label": 0}
{"id": "1669", "text": "they imagined joining us on the terrace", "label": 0}
{"id": "1670", "text": "he planned to join her in the guild hall", "label": 0}
{"id": "1671", "text": "i dreamed of you joining me on the cathedral steps", "label": 0}
{"id": "1672", "text": "we wished to join each other in the library", "label": 0}
{"id": "1673", "text": "she hoped to join me at the garden gate", "label": 0}
{"id": "1674", "text": "they planned to join the group in the armory", "label": 0}
{"id": "1675", "text": "he imagined joining me on the bridge", "label": 0}
{"id": "1676", "text": "i hoped we would join together in the tower room", "label": 0}
{"id": "1677", "text": "they wished to join us at the carriage yard", "label": 0}
{"id": "1678", "text": "she dreamed of joining me in the apothecary", "label": 0}
{"id": "1679", "text": "he planned to join her on the rooftop", "label": 0}
{"id": "1680", "text": "they hoped to join us in the crypt", "label": 0}
{"id": "1681", "text": "i imagined joining you at the courtyard well", "label": 0}
{"id": "1682", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1683", "text": "dance with me in the hall", "label": 1}
{"id": "1684", "text": "sit with me by the fountain", "label": 1}
{"id": "1685", "text": "dance with me on the terrace", "label": 1}
{"id": "1686", "text": "sit with me in the banquet hall", "label": 1}
{"id": "1687", "text": "dance with me in the guild hall", "label": 1}
{"id": "1688", "text": "sit with me in the library alcove", "label": 1}
{"id": "1689", "text": "dance with me at the garden gate", "label": 1}
{"id": "1690", "text": "sit with me in the greenhouse", "label": 1}
{"id": "1691", "text": "dance with me at the cathedral steps", "label": 1}
{"id": "1692", "text": "sit with me in the observatory dome", "label": 1}
{"id": "1693", "text": "dance with me in the courtyard", "label": 1}
{"id": "1694", "text": "sit with me on the rooftop", "label": 1}
{"id": "1695", "text": "dance with me in the tower room", "label": 1}
{"id": "1696", "text": "sit with me in the crypt", "label": 1}
{"id": "1697", "text": "i imagined us sitting in the tavern booth", "label": 0}
{"id": "1698", "text": "she dreamed of dancing with him in the hall", "label": 0}
{"id": "1699", "text": "they planned to sit together by the fountain", "label": 0}
{"id": "1700", "text": "i hoped we could dance on the terrace", "label": 0}
{"id": "1701", "text": "he wished to sit with her in the banquet hall", "label": 0}
{"id": "1702", "text": "they imagined dancing in the guild hall", "label": 0}
{"id": "1703", "text": "i dreamed of sitting in the library alcove", "label": 0}
{"id": "1704", "text": "she hoped to dance with me at the garden gate", "label": 0}
{"id": "1705", "text": "they wished to sit together in the greenhouse", "label": 0}
{"id": "1706", "text": "i planned to dance on the cathedral steps", "label": 0}
{"id": "1707", "text": "he imagined sitting with me in the observatory dome", "label": 0}
{"id": "1708", "text": "she hoped we could dance in the courtyard", "label": 0}
{"id": "1709", "text": "they wished to sit together on the rooftop", "label": 0}
{"id": "1710", "text": "i dreamed of dancing in the tower room", "label": 0}
{"id": "1711", "text": "he imagined us sitting quietly in the crypt", "label": 0}
{"id": "1712", "text": "hide with me in the cellar", "label": 1}
{"id": "1713", "text": "wait for me in the tower", "label": 1}
{"id": "1714", "text": "hide with me in the crypt", "label": 1}
{"id": "1715", "text": "wait with me in the courtyard", "label": 1}
{"id": "1716", "text": "hide with me in the armory", "label": 1}
{"id": "1717", "text": "wait for me at the riverbank", "label": 1}
{"id": "1718", "text": "hide with me in the observatory dome", "label": 1}
{"id": "1719", "text": "wait for me in the chapel", "label": 1}
{"id": "1720", "text": "hide with me in the greenhouse", "label": 1}
{"id": "1721", "text": "wait with me in the guild hall", "label": 1}
{"id": "1722", "text": "hide with me in the pantry", "label": 1}
{"id": "1723", "text": "wait for me at the gatehouse", "label": 1}
{"id": "1724", "text": "hide with me in the study", "label": 1}
{"id": "1725", "text": "wait with me in the banquet hall", "label": 1}
{"id": "1726", "text": "hide with me in the tower room", "label": 1}
{"id": "1727", "text": "i dreamed we hid together in the cellar", "label": 0}
{"id": "1728", "text": "she wished to wait for him in the tower", "label": 0}
{"id": "1729", "text": "they planned to hide in the crypt", "label": 0}
{"id": "1730", "text": "i hoped we could wait together in the courtyard", "label": 0}
{"id": "1731", "text": "he imagined hiding in the armory", "label": 0}
{"id": "1732", "text": "they wished to wait at the riverbank", "label": 0}
{"id": "1733", "text": "she hoped to hide in the observatory dome", "label": 0}
{"id": "1734", "text": "i imagined waiting for you in the chapel", "label": 0}
{"id": "1735", "text": "he dreamed of hiding in the greenhouse", "label": 0}
{"id": "1736", "text": "they planned to wait in the guild hall", "label": 0}
{"id": "1737", "text": "i wished we were hiding in the pantry", "label": 0}
{"id": "1738", "text": "she imagined waiting in the gatehouse", "label": 0}
{"id": "1739", "text": "they hoped to hide in the study", "label": 0}
{"id": "1740", "text": "i dreamed of waiting in the banquet hall", "label": 0}
{"id": "1741", "text": "he wished to hide with her in the tower room", "label": 0}
{"id": "1742", "text": "come to the library with me", "label": 1}
{"id": "1743", "text": "come into the chapel now", "label": 1}
{"id": "1744", "text": "step into the banquet hall with me", "label": 1}
{"id": "1745", "text": "come to the guild hall together", "label": 1}
{"id": "1746", "text": "come into the armory", "label": 1}
{"id": "1747", "text": "step into the crypt with me", "label": 1}
{"id": "1748", "text": "come to the study at once", "label": 1}
{"id": "1749", "text": "come into the tower room", "label": 1}
{"id": "1750", "text": "step into the greenhouse with me", "label": 1}
{"id": "1751", "text": "come to the observatory dome", "label": 1}
{"id": "1752", "text": "come into the library alcove", "label": 1}
{"id": "1753", "text": "step into the courtyard well with me", "label": 1}
{"id": "1754", "text": "come to the terrace", "label": 1}
{"id": "1755", "text": "come into the war room", "label": 1}
{"id": "1756", "text": "step into the bakery with me", "label": 1}
{"id": "1757", "text": "i dreamed of coming to the library with you", "label": 0}
{"id": "1758", "text": "she wished to come into the chapel someday", "label": 0}
{"id": "1759", "text": "they planned to step into the banquet hall later", "label": 0}
{"id": "1760", "text": "i hoped to come to the guild hall", "label": 0}
{"id": "1761", "text": "he imagined coming into the armory", "label": 0}
{"id": "1762", "text": "they wished to step into the crypt together", "label": 0}
{"id": "1763", "text": "she dreamed of coming to the study", "label": 0}
{"id": "1764", "text": "i planned to come into the tower room", "label": 0}
{"id": "1765", "text": "he imagined stepping into the greenhouse", "label": 0}
{"id": "1766", "text": "they hoped to come to the observatory dome", "label": 0}
{"id": "1767", "text": "she wished to come into the library alcove", "label": 0}
{"id": "1768", "text": "i imagined stepping into the courtyard well", "label": 0}
{"id": "1769", "text": "they planned to come to the terrace later", "label": 0}
{"id": "1770", "text": "he dreamed of coming into the war room", "label": 0}
{"id": "1771", "text": "i wished to step into the bakery with you", "label": 0}
{"id": "1772", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1773", "text": "come to the library alcove", "label": 1}
{"id": "1774", "text": "gather with me on the cathedral steps", "label": 1}
{"id": "1775", "text": "follow me into the tower room", "label": 1}
{"id": "1776", "text": "walk with me into the banquet hall", "label": 1}
{"id": "1777", "text": "hide with me near the garden gate", "label": 1}
{"id": "1778", "text": "join me in the map room", "label": 1}
{"id": "1779", "text": "meet me in the war room", "label": 1}
{"id": "1780", "text": "dance with me in the throne hall", "label": 1}
{"id": "1781", "text": "sit with me at the river gate", "label": 1}
{"id": "1782", "text": "come with me into the guard tower room", "label": 1}
{"id": "1783", "text": "wait with me in the guild hall", "label": 1}
{"id": "1784", "text": "sneak with me through the servant’s passage", "label": 1}
{"id": "1785", "text": "meet me in the bell tower room", "label": 1}
{"id": "1786", "text": "sit together in the scholar’s alcove", "label": 1}
{"id": "1787", "text": "i imagined us in the tavern booth", "label": 0}
{"id": "1788", "text": "she dreamed of sitting in the library alcove", "label": 0}
{"id": "1789", "text": "they wished to gather on the cathedral steps", "label": 0}
{"id": "1790", "text": "he planned to follow me into the tower room", "label": 0}
{"id": "1791", "text": "i hoped we could walk together in the banquet hall", "label": 0}
{"id": "1792", "text": "she wished to wait with me near the garden gate", "label": 0}
{"id": "1793", "text": "i dreamed of joining you in the map room", "label": 0}
{"id": "1794", "text": "they planned to meet later in the war room", "label": 0}
{"id": "1795", "text": "he imagined dancing in the throne hall", "label": 0}
{"id": "1796", "text": "i hoped to sit at the river gate", "label": 0}
{"id": "1797", "text": "she dreamed of coming into the guard tower room", "label": 0}
{"id": "1798", "text": "they wished to wait in the guild hall", "label": 0}
{"id": "1799", "text": "i imagined sneaking through the servant’s passage", "label": 0}
{"id": "1800", "text": "he hoped to meet her in the bell tower room", "label": 0}
{"id": "1801", "text": "they planned to sit in the scholar’s alcove", "label": 0}
{"id": "1802", "text": "walk with me to the garden", "label": 1}
{"id": "1803", "text": "meet me in the library", "label": 1}
{"id": "1804", "text": "follow me to the balcony", "label": 1}
{"id": "1805", "text": "sit with me in the tavern booth", "label": 1}
{"id": "1806", "text": "hide with me in the cellar", "label": 1}
{"id": "1807", "text": "wait in the tower for me", "label": 1}
{"id": "1808", "text": "meet me at the gatehouse", "label": 1}
{"id": "1809", "text": "wait for me in the courtyard", "label": 1}
{"id": "1810", "text": "join me in the banquet hall", "label": 1}
{"id": "1811", "text": "follow me to the tower room", "label": 1}
{"id": "1812", "text": "let's sit by the fountain", "label": 1}
{"id": "1813", "text": "come to the library alcove", "label": 1}
{"id": "1814", "text": "meet me on the rooftop", "label": 1}
{"id": "1815", "text": "join me at the harbor", "label": 1}
{"id": "1816", "text": "meet me in the greenhouse", "label": 1}
{"id": "1817", "text": "join me in the war room", "label": 1}
{"id": "1818", "text": "follow me to the map room", "label": 1}
{"id": "1819", "text": "meet me in the study", "label": 1}
{"id": "1820", "text": "let's sit in the gallery", "label": 1}
{"id": "1821", "text": "come with me onto the bridge", "label": 1}
{"id": "1822", "text": "meet me at the riverbank", "label": 1}
{"id": "1823", "text": "follow me to the garden gate", "label": 1}
{"id": "1824", "text": "join me on the terrace", "label": 1}
{"id": "1825", "text": "meet me in the kitchen", "label": 1}
{"id": "1826", "text": "walk with me to the bakery", "label": 1}
{"id": "1827", "text": "gather with me on the cathedral steps", "label": 1}
{"id": "1828", "text": "meet me under the bell tower", "label": 1}
{"id": "1829", "text": "come with me into the crypt", "label": 1}
{"id": "1830", "text": "wait for me at the river gate", "label": 1}
{"id": "1831", "text": "sit with me beside the fountain", "label": 1}
{"id": "1832", "text": "join me by the fountain in the courtyard", "label": 1}
{"id": "1833", "text": "come with me into the guard tower room", "label": 1}
{"id": "1834", "text": "walk with me into the banquet hall", "label": 1}
{"id": "1835", "text": "meet me at the cathedral steps", "label": 1}
{"id": "1836", "text": "sit with me in the scholar’s alcove", "label": 1}
{"id": "1837", "text": "follow me up to the watchtower", "label": 1}
{"id": "1838", "text": "join me at the garden gate", "label": 1}
{"id": "1839", "text": "wait with me in the guild hall", "label": 1}
{"id": "1840", "text": "hide with me in the wine cellar", "label": 1}
{"id": "1841", "text": "meet me at the courtyard well", "label": 1}
{"id": "1842", "text": "step with me into the library alcove", "label": 1}
{"id": "1843", "text": "come with me onto the terrace", "label": 1}
{"id": "1844", "text": "walk with me across the bridge", "label": 1}
{"id": "1845", "text": "join me in the map room", "label": 1}
{"id": "1846", "text": "dance with me in the banquet hall", "label": 1}
{"id": "1847", "text": "sit with me at the harbor pier", "label": 1}
{"id": "1848", "text": "follow me into the armory", "label": 1}
{"id": "1849", "text": "meet me by the garden fountain", "label": 1}
{"id": "1850", "text": "come into the study with me", "label": 1}
{"id": "1851", "text": "walk with me to the gatehouse", "label": 1}
{"id": "1852", "text": "join me in the tower room", "label": 1}
{"id": "1853", "text": "wait for me in the chapel", "label": 1}
{"id": "1854", "text": "hide with me behind the cathedral steps", "label": 1}
{"id": "1855", "text": "meet me on the castle rooftop", "label": 1}
{"id": "1856", "text": "come with me into the greenhouse", "label": 1}
{"id": "1857", "text": "follow me to the throne hall", "label": 1}
{"id": "1858", "text": "sit with me in the library alcove", "label": 1}
{"id": "1859", "text": "join me at the riverbank", "label": 1}
{"id": "1860", "text": "walk with me down to the docks", "label": 1}
{"id": "1861", "text": "come with me into the pantry", "label": 1}
{"id": "1862", "text": "meet me in the apothecary", "label": 1}
{"id": "1863", "text": "wait for me at the garden gate", "label": 1}
{"id": "1864", "text": "hide with me in the observatory dome", "label": 1}
{"id": "1865", "text": "join me in the guild hall", "label": 1}
{"id": "1866", "text": "follow me into the crypt", "label": 1}
{"id": "1867", "text": "come to the terrace and sit with me", "label": 1}
{"id": "1868", "text": "meet me at the harbor warehouse", "label": 1}
{"id": "1869", "text": "walk with me to the bakery stall", "label": 1}
{"id": "1870", "text": "sit with me in the gallery", "label": 1}
{"id": "1871", "text": "dance with me on the terrace", "label": 1}
{"id": "1872", "text": "follow me to the library reading room", "label": 1}
{"id": "1873", "text": "join me on the bridge", "label": 1}
{"id": "1874", "text": "come with me into the war room", "label": 1}
{"id": "1875", "text": "meet me in the tower room", "label": 1}
{"id": "1876", "text": "wait with me by the fountain", "label": 1}
{"id": "1877", "text": "hide with me in the cellar corner", "label": 1}
{"id": "1878", "text": "walk with me to the garden gate", "label": 1}
{"id": "1879", "text": "follow me to the watchtower stairs", "label": 1}
{"id": "1880", "text": "come with me into the map room", "label": 1}
{"id": "1881", "text": "sit with me in the banquet hall", "label": 1}
{"id": "1882", "text": "join me at the bell tower", "label": 1}
{"id": "1883", "text": "meet me at the cathedral steps", "label": 1}
{"id": "1884", "text": "walk with me into the greenhouse", "label": 1}
{"id": "1885", "text": "follow me to the harbor pier", "label": 1}
{"id": "1886", "text": "come with me onto the castle rooftop", "label": 1}
{"id": "1887", "text": "wait for me in the study", "label": 1}
{"id": "1888", "text": "hide with me in the tower room", "label": 1}
{"id": "1889", "text": "join me in the library alcove", "label": 1}
{"id": "1890", "text": "meet me by the courtyard fountain", "label": 1}
{"id": "1891", "text": "walk with me into the kitchen", "label": 1}
{"id": "1892", "text": "follow me to the bakery", "label": 1}
{"id": "1893", "text": "come with me to the garden", "label": 1}
{"id": "1894", "text": "sit with me near the garden gate", "label": 1}
{"id": "1895", "text": "dance with me in the throne hall", "label": 1}
{"id": "1896", "text": "join me on the cathedral steps", "label": 1}
{"id": "1897", "text": "wait for me in the courtyard gallery", "label": 1}
{"id": "1898", "text": "hide with me behind the fountain", "label": 1}
{"id": "1899", "text": "meet me inside the greenhouse", "label": 1}
{"id": "1900", "text": "come with me into the library", "label": 1}
{"id": "1901", "text": "follow me to the balcony rail", "label": 1}
{"id": "1902", "text": "imagine us in the tavern tonight", "label": 0}
{"id": "1903", "text": "i’m thinking of you in the garden", "label": 0}
{"id": "1904", "text": "we planned to meet in the library later", "label": 0}
{"id": "1905", "text": "maybe later we’ll go to the balcony", "label": 0}
{"id": "1906", "text": "just imagine us by the fountain", "label": 0}
{"id": "1907", "text": "i wish we were in the tower room", "label": 0}
{"id": "1908", "text": "dreaming of the cathedral steps again", "label": 0}
{"id": "1909", "text": "we hoped to sit in the tavern booth", "label": 0}
{"id": "1910", "text": "someday let’s visit the castle gardens", "label": 0}
{"id": "1911", "text": "only watching the courtyard from here", "label": 0}
{"id": "1912", "text": "thinking about the balcony view", "label": 0}
{"id": "1913", "text": "planning to sit by the fountain tomorrow", "label": 0}
{"id": "1914", "text": "we planned to meet in the hall but not now", "label": 0}
{"id": "1915", "text": "i hoped we could dance in the hall someday", "label": 0}
{"id": "1916", "text": "they imagined waiting at the riverbank", "label": 0}
{"id": "1917", "text": "i wished to read in the library alcove", "label": 0}
{"id": "1918", "text": "we’re just looking at the harbor from afar", "label": 0}
{"id": "1919", "text": "maybe later we’ll meet at the gatehouse", "label": 0}
{"id": "1920", "text": "we talked about going to the greenhouse", "label": 0}
{"id": "1921", "text": "i dream of us in the war room", "label": 0}
{"id": "1922", "text": "we plan to visit the map room next week", "label": 0}
{"id": "1923", "text": "i hope to study in the study one day", "label": 0}
{"id": "1924", "text": "we’re only watching the bridge from here", "label": 0}
{"id": "1925", "text": "maybe later let’s meet at the riverbank", "label": 0}
{"id": "1926", "text": "i’m thinking about the garden gate", "label": 0}
{"id": "1927", "text": "we hoped to sit on the terrace", "label": 0}
{"id": "1928", "text": "i wish we were in the kitchen already", "label": 0}
{"id": "1929", "text": "we planned to walk to the bakery tomorrow", "label": 0}
{"id": "1930", "text": "still dreaming of the bell tower view", "label": 0}
{"id": "1931", "text": "let’s go somewhere private someday", "label": 0}
{"id": "1932", "text": "i imagined us in the crypt, just fantasy", "label": 0}
{"id": "1933", "text": "we talked about the courtyard well", "label": 0}
{"id": "1934", "text": "maybe later we’ll sit in the gallery", "label": 0}
{"id": "1935", "text": "we planned to watch the docks at dusk", "label": 0}
{"id": "1936", "text": "i hope to meet you on the rooftop someday", "label": 0}
{"id": "1937", "text": "just picturing the guild hall lights", "label": 0}
{"id": "1938", "text": "we only watched the armory from outside", "label": 0}
{"id": "1939", "text": "i wish to rest by the fountain soon", "label": 0}
{"id": "1940", "text": "we planned to gather on the cathedral steps later", "label": 0}
{"id": "1941", "text": "i’m thinking about the map room again", "label": 0}
{"id": "1942", "text": "we hoped to hide in the cellar one day", "label": 0}
{"id": "2022", "text": "imagine us in the tavern after the rain", "label": 0}
{"id": "2023", "text": "i’m thinking of you in the garden, not going yet", "label": 0}
{"id": "2024", "text": "we planned to meet in the library tomorrow, not now", "label": 0}
{"id": "2025", "text": "maybe later we’ll go to the balcony", "label": 0}
{"id": "2026", "text": "just imagine us by the fountain for a moment", "label": 0}
{"id": "2027", "text": "i wish we were in the tower room already", "label": 0}
{"id": "2028", "text": "still dreaming of the cathedral steps", "label": 0}
{"id": "2029", "text": "we hoped to sit in the tavern booth someday", "label": 0}
{"id": "2030", "text": "someday let’s visit the castle gardens, not tonight", "label": 0}
{"id": "2031", "text": "only watching the courtyard from here", "label": 0}
{"id": "2032", "text": "thinking about the balcony view, staying put", "label": 0}
{"id": "2033", "text": "planning to sit by the fountain tomorrow", "label": 0}
{"id": "2034", "text": "we planned to meet in the hall later on", "label": 0}
{"id": "2035", "text": "i hoped we could dance in the hall someday", "label": 0}
{"id": "2036", "text": "they imagined waiting at the riverbank one day", "label": 0}
{"id": "2037", "text": "i wished to read in the library alcove eventually", "label": 0}
{"id": "2038", "text": "we’re just looking at the harbor from afar", "label": 0}
{"id": "2039", "text": "maybe later we’ll meet at the gatehouse", "label": 0}
{"id": "2040", "text": "we talked about going to the greenhouse, another time", "label": 0}
{"id": "2041", "text": "i dream of us in the war room, just a thought", "label": 0}
{"id": "2042", "text": "we plan to visit the map room next week", "label": 0}
{"id": "2043", "text": "i hope to study in the study one day", "label": 0}
{"id": "2044", "text": "we’re only watching the bridge from here", "label": 0}
{"id": "2045", "text": "maybe later let’s meet at the riverbank", "label": 0}
{"id": "2046", "text": "i’m thinking about the garden gate, not moving", "label": 0}
{"id": "2047", "text": "we hoped to sit on the terrace sometime", "label": 0}
{"id": "2048", "text": "i wish we were in the kitchen already, someday", "label": 0}
{"id": "2049", "text": "we planned to walk to the bakery tomorrow", "label": 0}
{"id": "2050", "text": "just picturing the bell tower at dusk", "label": 0}
{"id": "2051", "text": "let’s go somewhere private another time", "label": 0}
{"id": "2052", "text": "i imagined us in the crypt, only fantasy", "label": 0}
{"id": "2053", "text": "we talked about the courtyard well earlier", "label": 0}
{"id": "2054", "text": "maybe later we’ll sit in the gallery", "label": 0}
{"id": "2055", "text": "we planned to watch the docks at dusk", "label": 0}
{"id": "2056", "text": "i hope to meet you on the rooftop someday", "label": 0}
{"id": "2057", "text": "just picturing the guild hall lights at night", "label": 0}
{"id": "2058", "text": "we only watched the armory from outside", "label": 0}
{"id": "2059", "text": "i wish to rest by the fountain soon", "label": 0}
{"id": "2060", "text": "we planned to gather on the cathedral steps later", "label": 0}
{"id": "2061", "text": "i’m thinking about the map room again", "label": 0}
{"id": "2062", "text": "we hoped to hide in the cellar one day", "label": 0}
{"id": "2063", "text": "i dreamed we waited in the tower once", "label": 0}
{"id": "2064", "text": "we imagined meeting in the study, not today", "label": 0}
{"id": "2065", "text": "maybe later we’ll join them in the banquet hall", "label": 0}
{"id": "2066", "text": "just thinking about the library alcove again", "label": 0}
{"id": "2067", "text": "we plan to stroll to the garden tomorrow", "label": 0}
{"id": "2068", "text": "i hope we can visit the tower room next time", "label": 0}
{"id": "2069", "text": "only watching the terrace from the window", "label": 0}
{"id": "2070", "text": "someday we might sit in the tavern booth", "label": 0}
{"id": "2071", "text": "we talked about the riverbank earlier", "label": 0}
{"id": "2072", "text": "i imagine us near the garden gate someday", "label": 0}
{"id": "2073", "text": "planning to meet in the kitchen later", "label": 0}
{"id": "2074", "text": "we hoped to cross the bridge next week", "label": 0}
{"id": "2075", "text": "i wished to read in the study someday", "label": 0}
{"id": "2076", "text": "thinking about the rooftop breeze, staying here", "label": 0}
{"id": "2077", "text": "we planned to check the harbor tomorrow", "label": 0}
{"id": "2078", "text": "i dreamed of dancing in the hall one day", "label": 0}
{"id": "2079", "text": "maybe later we’ll meet by the fountain", "label": 0}
{"id": "2080", "text": "just imagining the greenhouse at sunrise", "label": 0}
{"id": "2081", "text": "we plan to visit the war room later", "label": 0}
{"id": "2082", "text": "i hope to sit in the gallery sometime", "label": 0}
{"id": "2083", "text": "only watching the cathedral from here", "label": 0}
{"id": "2084", "text": "someday we’ll climb the bell tower", "label": 0}
{"id": "2085", "text": "we talked about the gatehouse, not today", "label": 0}
{"id": "2086", "text": "i imagined meeting you at the harbor someday", "label": 0}
{"id": "2087", "text": "planning to rest by the fountain later", "label": 0}
{"id": "2088", "text": "we hoped to study in the library tomorrow", "label": 0}
{"id": "2089", "text": "i wish we were already on the terrace", "label": 0}
{"id": "2090", "text": "just thinking about the crypt, not going", "label": 0}
{"id": "2091", "text": "maybe later we’ll go to the castle", "label": 0}
{"id": "2092", "text": "we planned to hide in the cellar another day", "label": 0}
{"id": "2093", "text": "i dreamed of us at the courtyard well", "label": 0}
{"id": "2094", "text": "we imagined gathering on the steps someday", "label": 0}
{"id": "2095", "text": "only watching the garden gate for now", "label": 0}
{"id": "2096", "text": "i’m thinking about the study again", "label": 0}
{"id": "2097", "text": "we planned to cross the bridge tomorrow", "label": 0}
{"id": "2098", "text": "i hoped to meet on the rooftop one day", "label": 0}
{"id": "2099", "text": "just imagining the guild hall music", "label": 0}
{"id": "2100", "text": "we only watched the armory from the gate", "label": 0}
{"id": "2101", "text": "i wish to rest near the fountain later", "label": 0}
{"id": "2102", "text": "we planned to gather at the river gate later", "label": 0}
{"id": "2103", "text": "i’m thinking about the map room plan", "label": 0}
{"id": "2104", "text": "we hoped to wait in the tower next week", "label": 0}
{"id": "2105", "text": "i dreamed of sitting in the tavern booth", "label": 0}
{"id": "2106", "text": "maybe later we’ll meet at the harbor", "label": 0}
{"id": "2107", "text": "just imagining the greenhouse walkway", "label": 0}
{"id": "2108", "text": "we plan to visit the throne hall later", "label": 0}
{"id": "2109", "text": "i hope to sit in the library alcove someday", "label": 0}
{"id": "2110", "text": "only watching the courtyard fountain now", "label": 0}
{"id": "2111", "text": "someday we’ll climb the watchtower, not today", "label": 0}
{"id": "2112", "text": "we talked about the bakery for tomorrow", "label": 0}
{"id": "2113", "text": "i imagined meeting by the garden fountain", "label": 0}
{"id": "2114", "text": "planning to sit in the gallery next week", "label": 0}
{"id": "2115", "text": "we hoped to read in the study later", "label": 0}
{"id": "2116", "text": "i wish we were already at the riverbank", "label": 0}
{"id": "2117", "text": "just thinking about the cathedral steps", "label": 0}
{"id": "2118", "text": "maybe later we’ll go to the terrace", "label": 0}
{"id": "2119", "text": "we planned to meet in the hall next week", "label": 0}
{"id": "2120", "text": "i hoped we could visit the castle someday", "label": 0}
{"id": "2121", "text": "only watching the balcony from below", "label": 0}
{"id": "2222", "text": "follow me to the tower room", "label": 1}
{"id": "2223", "text": "come with me into the tower room", "label": 1}
{"id": "2224", "text": "meet me in the tower room now", "label": 1}
{"id": "2225", "text": "join me in the tower room, please", "label": 1}
{"id": "2226", "text": "walk with me to the tower room rn", "label": 1}
{"id": "2227", "text": "wait for me in the tower room", "label": 1}
{"id": "2228", "text": "follow me to the war room", "label": 1}
{"id": "2229", "text": "join me in the war room right now", "label": 1}
{"id": "2230", "text": "come with me into the war room", "label": 1}
{"id": "2231", "text": "meet me in the war room", "label": 1}
{"id": "2232", "text": "gather with me in the war room", "label": 1}
{"id": "2233", "text": "wait for me in the war room, okay", "label": 1}

{"id": "2234", "text": "follow me to the map room", "label": 1}
{"id": "2235", "text": "come with me into the map room", "label": 1}
{"id": "2236", "text": "join me in the map room", "label": 1}
{"id": "2237", "text": "meet me in the map room now", "label": 1}
{"id": "2238", "text": "walk with me to the map room pls", "label": 1}
{"id": "2239", "text": "wait for me in the map room", "label": 1}
{"id": "2240", "text": "follow me to the garden gate", "label": 1}
{"id": "2241", "text": "come with me to the garden gate", "label": 1}
{"id": "2242", "text": "meet me at the garden gate", "label": 1}
{"id": "2243", "text": "wait for me by the garden gate", "label": 1}
{"id": "2244", "text": "stand with me at the garden gate", "label": 1}
{"id": "2245", "text": "walk together to the garden gate", "label": 1}
{"id": "2246", "text": "meet me on the cathedral steps", "label": 1}
{"id": "2247", "text": "gather with me on the cathedral steps", "label": 1}
{"id": "2248", "text": "come sit with me on the cathedral steps", "label": 1}
{"id": "2249", "text": "wait for me on the cathedral steps", "label": 1}
{"id": "2250", "text": "follow me up to the cathedral steps", "label": 1}
{"id": "2251", "text": "join me on the cathedral steps", "label": 1}
{"id": "2252", "text": "come to the study with me", "label": 1}
{"id": "2253", "text": "walk with me to the study", "label": 1}
{"id": "2254", "text": "meet me in the study", "label": 1}
{"id": "2255", "text": "join me in the study, please", "label": 1}
{"id": "2256", "text": "wait for me in the study", "label": 1}
{"id": "2257", "text": "come sit with me in the study", "label": 1}
{"id": "2258", "text": "follow me to the riverbank", "label": 1}
{"id": "2259", "text": "meet me at the riverbank", "label": 1}
{"id": "2260", "text": "join me by the riverbank", "label": 1}
{"id": "2261", "text": "come with me to the riverbank", "label": 1}
{"id": "2262", "text": "wait for me at the riverbank", "label": 1}
{"id": "2263", "text": "walk with me to the riverbank", "label": 1}
{"id": "2264", "text": "join me at the gatehouse", "label": 1}
{"id": "2265", "text": "meet me at the gatehouse", "label": 1}
{"id": "2266", "text": "come to the gatehouse with me", "label": 1}
{"id": "2267", "text": "wait for me at the gatehouse", "label": 1}
{"id": "2268", "text": "follow me to the gatehouse", "label": 1}
{"id": "2269", "text": "walk with me to the gatehouse", "label": 1}
{"id": "2270", "text": "join me in the kitchen", "label": 1}
{"id": "2271", "text": "come with me into the kitchen", "label": 1}
{"id": "2272", "text": "meet me in the kitchen", "label": 1}
{"id": "2273", "text": "wait for me in the kitchen", "label": 1}
{"id": "2274", "text": "follow me to the kitchen", "label": 1}
{"id": "2275", "text": "walk with me to the kitchen", "label": 1}
{"id": "2276", "text": "join me at the bridge", "label": 1}
{"id": "2277", "text": "meet me at the bridge", "label": 1}
{"id": "2278", "text": "follow me to the bridge now", "label": 1}
{"id": "2279", "text": "walk with me to the bridge", "label": 1}
{"id": "2280", "text": "wait for me at the bridge", "label": 1}
{"id": "2281", "text": "come to the bridge with me", "label": 1}
{"id": "2282", "text": "follow me to the cloister", "label": 1}
{"id": "2283", "text": "meet me in the cloister", "label": 1}
{"id": "2284", "text": "come with me into the cloister", "label": 1}
{"id": "2285", "text": "wait for me in the cloister", "label": 1}
{"id": "2286", "text": "join me in the cloister", "label": 1}
{"id": "2287", "text": "walk with me to the cloister", "label": 1}
{"id": "2288", "text": "meet me at the bakery tonight", "label": 1}
{"id": "2289", "text": "join me at the bakery", "label": 1}
{"id": "2290", "text": "come to the bakery with me", "label": 1}
{"id": "2291", "text": "wait for me at the bakery", "label": 1}
{"id": "2292", "text": "walk with me to the bakery", "label": 1}
{"id": "2293", "text": "follow me to the bakery", "label": 1}
{"id": "2294", "text": "meet me in the library alcove", "label": 1}
{"id": "2295", "text": "come with me into the library alcove", "label": 1}
{"id": "2296", "text": "wait for me in the library alcove", "label": 1}
{"id": "2297", "text": "join me in the library alcove", "label": 1}
{"id": "2298", "text": "walk with me to the library alcove", "label": 1}
{"id": "2299", "text": "follow me to the library alcove", "label": 1}
{"id": "2300", "text": "climb with me to the cathedral steps", "label": 1}
{"id": "2301", "text": "stand with me on the cathedral steps", "label": 1}
{"id": "2302", "text": "wait together on the cathedral steps", "label": 1}
{"id": "2303", "text": "let’s talk on the cathedral steps", "label": 1}
{"id": "2304", "text": "join me up on the cathedral steps", "label": 1}
{"id": "2305", "text": "meet me right on the cathedral steps", "label": 1}
{"id": "2306", "text": "imagine us in the tavern, not going now", "label": 0}
{"id": "2307", "text": "i’m thinking of you in the kitchen, staying here", "label": 0}
{"id": "2308", "text": "we planned to meet in the study later", "label": 0}
{"id": "2309", "text": "maybe later we’ll go to the bridge", "label": 0}
{"id": "2310", "text": "just imagine us at the riverbank", "label": 0}
{"id": "2311", "text": "i wish we were at the bakery already", "label": 0}
{"id": "2312", "text": "dreaming of the cathedral steps again", "label": 0}
{"id": "2313", "text": "we hoped to sit in the library alcove someday", "label": 0}
{"id": "2314", "text": "thinking about the cloister view, not moving", "label": 0}
{"id": "2315", "text": "only watching the gatehouse from here", "label": 0}
{"id": "2316", "text": "someday let’s visit the war room", "label": 0}
{"id": "2317", "text": "we plan to check the map room next week", "label": 0}
{"id": "2318", "text": "i dreamed of us in the tower room", "label": 0}
{"id": "2319", "text": "i hope we meet at the garden gate one day", "label": 0}
{"id": "2320", "text": "maybe later we’ll go to the cloister", "label": 0}
{"id": "2321", "text": "just imagine us in the war room", "label": 0}
{"id": "2322", "text": "i wish we were in the map room now", "label": 0}
{"id": "2323", "text": "thinking about the library alcove tonight", "label": 0}
{"id": "2324", "text": "we planned to meet on the bridge tomorrow", "label": 0}
{"id": "2325", "text": "only watching the riverbank for now", "label": 0}
{"id": "2326", "text": "someday let’s walk to the bakery", "label": 0}
{"id": "2327", "text": "i hope to study in the study later", "label": 0}
{"id": "2328", "text": "i dreamed of waiting at the gatehouse", "label": 0}
{"id": "2329", "text": "just imagining the kitchen at dawn", "label": 0}
{"id": "2330", "text": "maybe later we’ll meet on the cathedral steps", "label": 0}
{"id": "2331", "text": "we plan to pass by the garden gate next week", "label": 0}
{"id": "2332", "text": "i wish we were in the tower room someday", "label": 0}
{"id": "2333", "text": "thinking about the war room strategy", "label": 0}
{"id": "2334", "text": "we hoped to check the map room later", "label": 0}
{"id": "2335", "text": "only watching the library alcove from afar", "label": 0}
{"id": "2336", "text": "imagine us at the riverbank tonight", "label": 0}
{"id": "2337", "text": "i’m thinking about the bridge lights", "label": 0}
{"id": "2338", "text": "we planned to wait in the cloister another time", "label": 0}
{"id": "2339", "text": "maybe later we’ll go to the gatehouse", "label": 0}
{"id": "2340", "text": "just imagine us in the kitchen together", "label": 0}
{"id": "2341", "text": "i wish we were in the study right now", "label": 0}
{"id": "3001", "text": "follow me to the training ground", "label": 1}
{"id": "3002", "text": "meet me at the training ground by the mats", "label": 1}
{"id": "3003", "text": "join me in the training ground tonight", "label": 1}
{"id": "3004", "text": "walk with me to the training ground rn", "label": 1}
{"id": "3005", "text": "i imagined us sparring at the training ground", "label": 0}
{"id": "3006", "text": "dreaming of the training ground tomorrow", "label": 0}
{"id": "3007", "text": "we planned to meet in the training ground someday", "label": 0}
{"id": "3008", "text": "thinking of you while watching the training ground", "label": 0}

{"id": "3009", "text": "come with me into the city park", "label": 1}
{"id": "3010", "text": "join me at the city park fountain", "label": 1}
{"id": "3011", "text": "walk with me through the city park", "label": 1}
{"id": "3012", "text": "meet me in the city park tonight", "label": 1}
{"id": "3013", "text": "imagine us in the city park later", "label": 0}
{"id": "3014", "text": "i wish we were sitting in the city park", "label": 0}
{"id": "3015", "text": "maybe someday we’ll go to the city park", "label": 0}
{"id": "3016", "text": "thinking of lanterns in the city park", "label": 0}

{"id": "3017", "text": "follow me to the skyscraper rooftop", "label": 1}
{"id": "3018", "text": "join me on the skyscraper rooftop", "label": 1}
{"id": "3019", "text": "walk with me to the rooftop view", "label": 1}
{"id": "3020", "text": "meet me on the skyscraper rooftop now", "label": 1}
{"id": "3021", "text": "i dreamed of us on the skyscraper rooftop", "label": 0}
{"id": "3022", "text": "imagine the rooftop city lights", "label": 0}
{"id": "3023", "text": "someday we’ll go to the rooftop", "label": 0}
{"id": "3024", "text": "just thinking of neon on the rooftop", "label": 0}

{"id": "3025", "text": "come with me into the dark alley", "label": 1}
{"id": "3026", "text": "follow me down the dark alley", "label": 1}
{"id": "3027", "text": "meet me in the dark alley tonight", "label": 1}
{"id": "3028", "text": "join me at the dark alley corner", "label": 1}
{"id": "3029", "text": "i wish we were in the dark alley", "label": 0}
{"id": "3030", "text": "imagine danger in the dark alley", "label": 0}
{"id": "3031", "text": "maybe later the dark alley", "label": 0}
{"id": "3032", "text": "thinking about the dark alley thrill", "label": 0}

{"id": "3033", "text": "join me in the subway station", "label": 1}
{"id": "3034", "text": "follow me to the subway station rn", "label": 1}
{"id": "3035", "text": "meet me at the subway station platform", "label": 1}
{"id": "3036", "text": "come with me into the subway station", "label": 1}
{"id": "3037", "text": "imagine us waiting in the subway station", "label": 0}
{"id": "3038", "text": "dreaming about the subway trains", "label": 0}
{"id": "3039", "text": "maybe later we’ll go to the subway", "label": 0}
{"id": "3040", "text": "thinking about the subway station noise", "label": 0}

{"id": "3041", "text": "come to mirko’s apartment with me", "label": 1}
{"id": "3042", "text": "meet me in mirko’s apartment", "label": 1}
{"id": "3043", "text": "join me at mirko’s apartment", "label": 1}
{"id": "3044", "text": "follow me to mirko’s apartment", "label": 1}
{"id": "3045", "text": "i dreamed of us in mirko’s apartment", "label": 0}
{"id": "3046", "text": "imagine training in mirko’s apartment", "label": 0}
{"id": "3047", "text": "maybe someday in mirko’s apartment", "label": 0}
{"id": "3048", "text": "thinking about mirko’s apartment tonight", "label": 0}

{"id": "3049", "text": "walk with me to the heroes’ dormitory", "label": 1}
{"id": "3050", "text": "join me in the heroes’ dormitory", "label": 1}
{"id": "3051", "text": "come with me into the heroes’ dormitory", "label": 1}
{"id": "3052", "text": "meet me at the heroes’ dormitory entrance", "label": 1}
{"id": "3053", "text": "i imagined us in the heroes’ dormitory", "label": 0}
{"id": "3054", "text": "dreaming of the heroes’ dormitory hallways", "label": 0}
{"id": "3055", "text": "someday let’s go to the heroes’ dormitory", "label": 0}
{"id": "3056", "text": "thinking about heroes’ dormitory rn", "label": 0}

{"id": "3057", "text": "join me in the gym training hall", "label": 1}
{"id": "3058", "text": "follow me to the training hall", "label": 1}
{"id": "3059", "text": "come with me into the gym", "label": 1}
{"id": "3060", "text": "meet me in the gym hall tonight", "label": 1}
{"id": "3061", "text": "i wish we were in the training hall", "label": 0}
{"id": "3062", "text": "imagine us in the sweaty gym", "label": 0}
{"id": "3063", "text": "dreaming about the training hall lights", "label": 0}
{"id": "3064", "text": "maybe later we’ll train in the gym", "label": 0}

{"id": "3065", "text": "follow me to the japanese bathhouse", "label": 1}
{"id": "3066", "text": "come with me into the bathhouse", "label": 1}
{"id": "3067", "text": "meet me in the japanese bathhouse", "label": 1}
{"id": "3068", "text": "join me at the sentō tonight", "label": 1}
{"id": "3069", "text": "i dreamed of us in the bathhouse steam", "label": 0}
{"id": "3070", "text": "imagine sitting in the hot water", "label": 0}
{"id": "3071", "text": "maybe later the bathhouse", "label": 0}
{"id": "3072", "text": "thinking about the japanese bathhouse now", "label": 0}

{"id": "3073", "text": "join me in the empty cinema hall", "label": 1}
{"id": "3074", "text": "follow me to the cinema tonight", "label": 1}
{"id": "3075", "text": "meet me in the cinema hall", "label": 1}
{"id": "3076", "text": "come with me into the cinema", "label": 1}
{"id": "3077", "text": "i wish we were in the cinema together", "label": 0}
{"id": "3078", "text": "imagine watching alone in the cinema", "label": 0}
{"id": "3079", "text": "maybe later in the cinema hall", "label": 0}
{"id": "3080", "text": "dreaming of the cinema light", "label": 0}

{"id": "3081", "text": "follow me to the night beach", "label": 1}
{"id": "3082", "text": "come with me to the night beach", "label": 1}
{"id": "3083", "text": "meet me at the night beach now", "label": 1}
{"id": "3084", "text": "join me on the night beach", "label": 1}
{"id": "3085", "text": "i dreamed of us at the night beach", "label": 0}
{"id": "3086", "text": "imagine moonlight at the beach", "label": 0}
{"id": "3087", "text": "someday let’s walk the night beach", "label": 0}
{"id": "3088", "text": "thinking about the night beach waves", "label": 0}

{"id": "3089", "text": "meet me in the mountain hot springs", "label": 1}
{"id": "3090", "text": "follow me to the hot springs", "label": 1}
{"id": "3091", "text": "join me in the mountain hot springs", "label": 1}
{"id": "3092", "text": "come with me into the hot springs", "label": 1}
{"id": "3093", "text": "dreaming about the hot springs steam", "label": 0}
{"id": "3094", "text": "imagine us in the mountain hot springs", "label": 0}
{"id": "3095", "text": "maybe later we’ll go to the hot springs", "label": 0}
{"id": "3096", "text": "thinking about mountain hot springs rn", "label": 0}

{"id": "3097", "text": "follow me to the abandoned warehouse", "label": 1}
{"id": "3098", "text": "come with me into the warehouse", "label": 1}
{"id": "3099", "text": "meet me in the abandoned warehouse", "label": 1}
{"id": "3100", "text": "join me at the abandoned warehouse", "label": 1}
{"id": "3101", "text": "i wish we were in the warehouse now", "label": 0}
{"id": "3102", "text": "imagine us in the abandoned warehouse", "label": 0}
{"id": "3103", "text": "someday let’s sneak into the warehouse", "label": 0}
{"id": "3104", "text": "thinking about the abandoned warehouse", "label": 0}

{"id": "3105", "text": "meet me backstage at the festival stage", "label": 1}
{"id": "3106", "text": "join me behind the festival stage", "label": 1}
{"id": "3107", "text": "come with me into the festival stage area", "label": 1}
{"id": "3108", "text": "follow me backstage now", "label": 1}
{"id": "3109", "text": "i dreamed of us behind the festival stage", "label": 0}
{"id": "3110", "text": "imagine the music at the festival stage", "label": 0}
{"id": "3111", "text": "maybe later we’ll go backstage", "label": 0}
{"id": "3112", "text": "thinking about the festival stage crowd", "label": 0}

{"id": "3113", "text": "walk with me to the academy library", "label": 1}
{"id": "3114", "text": "join me in the academy library", "label": 1}
{"id": "3115", "text": "follow me to the academy library", "label": 1}
{"id": "3116", "text": "meet me in the academy library tonight", "label": 1}
{"id": "3117", "text": "i dreamed of us in the academy library", "label": 0}
{"id": "3118", "text": "imagine reading in the academy library", "label": 0}
{"id": "3119", "text": "someday we’ll study in the academy library", "label": 0}
{"id": "3120", "text": "thinking about the academy library shelves", "label": 0}
{"id": "3121", "text": "follow me to the tower room", "label": 1}
{"id": "3122", "text": "come with me into the tower room rn", "label": 1}
{"id": "3123", "text": "join me in the tower room, please", "label": 1}
{"id": "3124", "text": "meet me in the tower room tonight", "label": 1}
{"id": "3125", "text": "i dreamed of us in the tower room", "label": 0}
{"id": "3126", "text": "maybe later we’ll go to the tower room", "label": 0}

{"id": "3127", "text": "join me at the harbor", "label": 1}
{"id": "3128", "text": "walk with me to the harbor now", "label": 1}
{"id": "3129", "text": "meet me at the harbor gate", "label": 1}
{"id": "3130", "text": "wait for me at the harbor", "label": 1}
{"id": "3131", "text": "imagine us at the harbor someday", "label": 0}
{"id": "3132", "text": "we planned to meet at the harbor next week", "label": 0}

{"id": "3133", "text": "follow me to the map room", "label": 1}
{"id": "3134", "text": "come with me into the map room", "label": 1}
{"id": "3135", "text": "join me in the map room right now", "label": 1}
{"id": "3136", "text": "meet me in the map room", "label": 1}
{"id": "3137", "text": "just imagining the map room lights", "label": 0}
{"id": "3138", "text": "maybe later we’ll check the map room", "label": 0}

{"id": "3139", "text": "come with me onto the bridge", "label": 1}
{"id": "3140", "text": "join me at the bridge", "label": 1}
{"id": "3141", "text": "follow me to the bridge rn", "label": 1}
{"id": "3142", "text": "meet me on the bridge tonight", "label": 1}
{"id": "3143", "text": "thinking about the bridge lights only", "label": 0}
{"id": "3144", "text": "someday we’ll walk to the bridge", "label": 0}

{"id": "3145", "text": "follow me to the garden gate", "label": 1}
{"id": "3146", "text": "meet me at the garden gate", "label": 1}
{"id": "3147", "text": "wait for me by the garden gate", "label": 1}
{"id": "3148", "text": "walk with me to the garden gate", "label": 1}
{"id": "3149", "text": "i hope we’ll stop by the garden gate later", "label": 0}
{"id": "3150", "text": "just imagine us at the garden gate", "label": 0}

{"id": "3151", "text": "come to the study with me", "label": 1}
{"id": "3152", "text": "walk with me to the study", "label": 1}
{"id": "3153", "text": "join me in the study", "label": 1}
{"id": "3154", "text": "meet me in the study after dark", "label": 1}
{"id": "3155", "text": "i wish we were in the study now", "label": 0}
{"id": "3156", "text": "we planned to study in the study tomorrow", "label": 0}

{"id": "3157", "text": "meet me at the bakery", "label": 1}
{"id": "3158", "text": "join me at the bakery this evening", "label": 1}
{"id": "3159", "text": "follow me to the bakery", "label": 1}
{"id": "3160", "text": "walk with me to the bakery rn", "label": 1}
{"id": "3161", "text": "i dreamed of us at the bakery", "label": 0}
{"id": "3162", "text": "maybe later we’ll go to the bakery", "label": 0}

{"id": "3163", "text": "follow me to the riverbank", "label": 1}
{"id": "3164", "text": "meet me at the riverbank", "label": 1}
{"id": "3165", "text": "come with me to the riverbank pls", "label": 1}
{"id": "3166", "text": "wait for me at the riverbank", "label": 1}
{"id": "3167", "text": "thinking about the riverbank breeze", "label": 0}
{"id": "3168", "text": "someday let’s sit by the riverbank", "label": 0}

{"id": "3169", "text": "meet me beside the fountain", "label": 1}
{"id": "3170", "text": "join me by the fountain", "label": 1}
{"id": "3171", "text": "walk with me to the fountain", "label": 1}
{"id": "3172", "text": "come to the fountain with me", "label": 1}
{"id": "3173", "text": "i hope we sit by the fountain later", "label": 0}
{"id": "3174", "text": "just imagine us near the fountain", "label": 0}

{"id": "3175", "text": "let’s head to the tower room now", "label": 1}
{"id": "3176", "text": "meet me at the harbor right now", "label": 1}
{"id": "3177", "text": "let’s go to the map room together", "label": 1}
{"id": "3178", "text": "come meet me on the bridge", "label": 1}
{"id": "3179", "text": "we planned to be at the harbor tomorrow", "label": 0}
{"id": "3180", "text": "only watching the riverbank from here", "label": 0}
